{
  "data": [
    {
      "title": "Ethics Pathways: A Design Activity for Reflecting on Ethics Engagement in HCI Research",
      "author": "Cha, Inha and Pillai, Ajit G. and Wong, Richmond Y.",
      "doi": "10.1145/3643834.3660714",
      "url": "https://doi.org/10.1145/3643834.3660714",
      "abstract": "This paper introduces Ethics Pathways, a design activity aimed at understanding HCI and design researchers’ ethics engagements and flows during their research process. Despite a strong ethical commitment in these fields, challenges persist in grasping the complexity of researchers’ engagement with ethics —practices conducted to operationalize ethics—in situated institutional contexts. Ethics Pathways, developed through six playtesting sessions, offers a design approach to understanding the complexities of researchers’ past ethics engagements in their work. This activity involves four main tasks: recalling ethical incidents; describing stakeholders involved in the situation; recounting their actions or speculative alternatives; and reflection and emotion walk-through. The paper reflects on the role of design decisions and facilitation strategies in achieving these goals. The design activity contributes to the discourse on ethical HCI research by conceptualizing ethics engagement as a part of ongoing research processing, highlighting connections between individual affective experiences, social interactions across power differences, and institutional goals.",
      "booktitle": "Proceedings of the 2024 ACM Designing Interactive Systems Conference",
      "year": "2024",
      "publisher": "Association for Computing Machinery",
      "series": "DIS '24"
    },
    {
      "title": "One Size (Doesn't) Fit All: Exploring design considerations for digital body dissatisfaction interventions with underrepresented populations",
      "author": "Shrestha, Pranita and Delir Haghighi, Pari and Sharp, Gemma and Xie, Jue and McNaney, Roisin",
      "doi": "10.1145/3643834.3661539",
      "url": "https://doi.org/10.1145/3643834.3661539",
      "abstract": "Traditionally, body dissatisfaction interventions have been designed with a focus on females from Western cultures. However, with growing research indicating that body dissatisfaction is experienced across society, regardless of gender and cultural background, it is increasingly important that future interventions incorporate a broader range of socio-cultural experiences. We conducted a two-phase co-design study with thirteen participants (seven females, six males), aged 18-24, from diverse cultural backgrounds. Phase 1 aimed to understand the influencing factors that frame the development of body image perceptions. Drawing on insights from Phase 1, Phase 2, then explicitly focused on gathering design insights for digital tools for body dissatisfaction interventions. Four narrative design concepts were used to provoke discussions and ideate around potential digital interventions. Through this paper, we contribute unique insights into the experiences and digital intervention preferences of underrepresented people in body image research and highlight future directions to create more inclusive digital interventions.",
      "booktitle": "Proceedings of the 2024 ACM Designing Interactive Systems Conference",
      "year": "2024",
      "publisher": "Association for Computing Machinery",
      "series": "DIS '24"
    },
    {
      "title": "Art Directing Blended Experiences",
      "author": "Mastermaker, Michael and Okeefe, Brian J and Resmini, Andrea and Flint, Tom",
      "doi": "10.1145/3643834.3665970",
      "url": "https://doi.org/10.1145/3643834.3665970",
      "abstract": "Interactions between the physical and the digital have become increasingly ubiquitous. They are particularly challenging to visualize and illustrate, as they usually unfold over time and space and involve multiple devices, locations, services, and actors. Traditional approaches to sketching user experiences and storyboarding fall short of clearly illustrating how meaningful relationships between people, things, technology, and places are created when they are consistently transitioning from physical spaces into digital spaces and back again. To address this gap, the pictorial showcases how a design framework based on blending theory informs our illustrative best practices and techniques for Art Directing Blended Experiences. The pictorial further discusses the opportunities and challenges of this narrative sketching technique to help designers further explore and capture the essence of how things, relationships, people, and change weave together new personal social spaces and deeper meanings of physical place.",
      "booktitle": "Proceedings of the 2024 ACM Designing Interactive Systems Conference",
      "year": "2024",
      "publisher": "Association for Computing Machinery",
      "series": "DIS '24"
    }
  ],
  "years": [
    "2025",
    "2024",
    "2003"
  ]
}