[{"id": "2506.11610", "relevance": "high", "reason": "The paper explores digital tools in design practice, focusing on client-designer collaboration. Such interactions require creative processes for effective requirements elicitation, making this work highly relevant to creativity.", "title": "\"If we misunderstand the client, we misspend 100 hours\": Exploring conversational AI and response types for information elicitation", "authers": [{"author_name": "Daniel Hove Paludan", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Paludan,+D+H"}, {"author_name": "Julie Fredsgård", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Fredsg%C3%A5rd,+J"}, {"author_name": "Kasper Patrick Bährentz", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=B%C3%A4hrentz,+K+P"}, {"author_name": "Ilhan Aslan", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Aslan,+I"}], "journal_ref": null, "subjects": ["Human-Computer Interaction (cs.HC)"], "links": {"abstract": "https://arxiv.org/abs/2506.11610", "pdf": "https://arxiv.org/pdf/2506.11610", "html": "https://arxiv.org/html/2506.11610v1", "other": "https://arxiv.org/format/2506.11610"}, "abstract": "Client-designer alignment is crucial to the success of design projects, yet little research has explored how digital technologies might influence this alignment. To address this gap, this paper presents a three-phase study investigating how digital systems can support requirements elicitation in professional design practice. Specifically, it examines how integrating a conversational agent and choice-based response formats into a digital elicitation tool affects early-stage client-designer collaboration. The first phase of the study inquired into the current practices of 10 design companies through semi-structured interviews, informing the system's design. The second phase evaluated the system using a 2x2 factorial design with 50 mock clients, quantifying the effects of conversational AI and response type on user experience and perceived preparedness. In phase three, the system was presented to seven of the original 10 companies to gather reflections on its value, limitations, and potential integration into practice. Findings show that both conversational AI and choice-based responses lead to lower dependability scores on the User Experience Questionnaire, yet result in client input with greater clarity. We contribute design implications for integrating conversational AI and choice-based responses into elicitation tools to support mutual understanding in early-stage client-designer collaboration."}, {"id": "2506.11326", "relevance": "moderate", "reason": "This research involves project-based learning in AI education, focusing on collaboration and project quality, which can stimulate creative educational methods, but creativity itself is not a primary focus.", "title": "Combining Log Data and Collaborative Dialogue Features to Predict Project Quality in Middle School AI Education", "authers": [{"author_name": "Conrad Borchers", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Borchers,+C"}, {"author_name": "Xiaoyi Tian", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Tian,+X"}, {"author_name": "Kristy Elizabeth Boyer", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Boyer,+K+E"}, {"author_name": "Maya Israel", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Israel,+M"}], "journal_ref": null, "subjects": ["Human-Computer Interaction (cs.HC)"], "links": {"abstract": "https://arxiv.org/abs/2506.11326", "pdf": "https://arxiv.org/pdf/2506.11326", "html": "https://arxiv.org/html/2506.11326v1", "other": "https://arxiv.org/format/2506.11326"}, "abstract": "Project-based learning plays a crucial role in computing education. However, its open-ended nature makes tracking project development and assessing success challenging. We investigate how dialogue and system interaction logs predict project quality during collaborative, project-based AI learning of 94 middle school students working in pairs. We used linguistic features from dialogue transcripts and behavioral features from system logs to predict three project quality outcomes: productivity (number of training phrases), content richness (word density), and lexical variation (word diversity) of chatbot training phrases. We compared the predictive accuracy of each modality and a fusion of the modalities. Results indicate log data better predicts productivity, while dialogue data is more effective for content richness. Both modalities modestly predict lexical variation. Multimodal fusion improved predictions for productivity and lexical variation of training phrases but not content richness. These findings suggest that the value of multimodal fusion depends on the specific learning outcome. The study contributes to multimodal learning analytics by demonstrating the nuanced interplay between behavioral and linguistic data in assessing student learning progress in open-ended AI learning environments."}, {"id": "2506.11393", "relevance": "moderate", "reason": "The focus on co-designing a chatbot to enhance communication in healthcare involves elements of creative problem-solving, though it isn't solely centered on creativity.", "title": "Co-Designing a Chatbot for Culturally Competent Clinical Communication: Experience and Reflections", "authers": [{"author_name": "Sandro Radovanović", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Radovanovi%C4%87,+S"}, {"author_name": "Shuangyu Li", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Li,+S"}], "journal_ref": null, "subjects": ["Human-Computer Interaction (cs.HC)", " Computers and Society (cs.CY)"], "links": {"abstract": "https://arxiv.org/abs/2506.11393", "pdf": "https://arxiv.org/pdf/2506.11393", "html": "https://arxiv.org/html/2506.11393v1", "other": "https://arxiv.org/format/2506.11393"}, "abstract": "Clinical communication skills are essential for preparing healthcare professionals to provide equitable care across cultures. However, traditional training with simulated patients can be resource intensive and difficult to scale, especially in under-resourced settings. In this project, we explore the use of an AI-driven chatbot to support culturally competent communication training for medical students. The chatbot was designed to simulate realistic patient conversations and provide structured feedback based on the ACT Cultural Competence model. We piloted the chatbot with a small group of third-year medical students at a UK medical school in 2024. Although we did not follow a formal experimental design, our experience suggests that the chatbot offered useful opportunities for students to reflect on their communication, particularly around empathy and interpersonal understanding. More challenging areas included addressing systemic issues and historical context. Although this early version of the chatbot helped surface some interesting patterns, limitations were also clear, such as the absence of nonverbal cues and the tendency for virtual patients to be overly agreeable. In general, this reflection highlights both the potential and the current limitations of AI tools in communication training. More work is needed to better understand their impact and improve the learning experience."}, {"id": "2506.11718", "relevance": "moderate", "reason": "Proposing a distinct framework for human-agent collaboration hints at innovative methods that could foster creativity in system design, though the main focus isn't directly on creativity.", "title": "Interaction, Process, Infrastructure: A Unified Architecture for Human-Agent Collaboration", "authers": [{"author_name": "Yun Wang", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Wang,+Y"}, {"author_name": "Yan Lu", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Lu,+Y"}], "journal_ref": null, "subjects": ["Human-Computer Interaction (cs.HC)", " Artificial Intelligence (cs.AI)"], "links": {"abstract": "https://arxiv.org/abs/2506.11718", "pdf": "https://arxiv.org/pdf/2506.11718", "html": "https://arxiv.org/html/2506.11718v1", "other": "https://arxiv.org/format/2506.11718"}, "abstract": "As AI tools proliferate across domains, from chatbots and copilots to emerging agents, they increasingly support professional knowledge work. Yet despite their growing capabilities, these systems remain fragmented: they assist with isolated tasks but lack the architectural scaffolding for sustained, adaptive collaboration. We propose a layered framework for human-agent systems that integrates three interdependent dimensions: interaction, process, and infrastructure. Crucially, our architecture elevates process to a primary focus by making it explicit, inspectable, and adaptable, enabling humans and agents to align with evolving goals and coordinate over time. This model clarifies limitations of current tools, unifies emerging system design approaches, and reveals new opportunities for researchers and AI system builders. By grounding intelligent behavior in structured collaboration, we reimagine human-agent collaboration not as task-specific augmentation, but as a form of coherent and aligned system for real-world work."}, {"id": "2506.11781", "relevance": "moderate", "reason": "Integrating LLMs into geospatial data frameworks suggests new creative approaches to data management and interpretation, but creativity isn't the central theme.", "title": "GeoPandas-AI: A Smart Class Bringing LLM as Stateful AI Code Assistant", "authers": [{"author_name": "Gaspard Merten", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Merten,+G"}, {"author_name": "Gilles Dejaegere", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Dejaegere,+G"}, {"author_name": "Mahmoud Sakr", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Sakr,+M"}], "journal_ref": null, "subjects": ["Human-Computer Interaction (cs.HC)", " Software Engineering (cs.SE)"], "links": {"abstract": "https://arxiv.org/abs/2506.11781", "pdf": "https://arxiv.org/pdf/2506.11781", "html": "https://arxiv.org/html/2506.11781v1", "other": "https://arxiv.org/format/2506.11781"}, "abstract": "Geospatial data analysis plays a crucial role in tackling intricate societal challenges such as urban planning and climate modeling. However, employing tools like GeoPandas, a prominent Python library for geospatial data manipulation, necessitates expertise in complex domain-specific syntax and workflows. GeoPandas-AI addresses this gap by integrating LLMs directly into the GeoPandas workflow, transforming the GeoDataFrame class into an intelligent, stateful class for both data analysis and geospatial code development. This paper formalizes the design of such a smart class and provides an open-source implementation of GeoPandas-AI in PyPI package manager. Through its innovative combination of conversational interfaces and stateful exploitation of LLMs for code generation and data analysis, GeoPandas-AI introduces a new paradigm for code-copilots and instantiates it for geospatial development."}, {"id": "2409.07406", "relevance": "moderate", "reason": "The modeling of trust dynamics using personal characteristics can inspire creative interpersonal and AI design approaches, though creativity isn't the explicit focus here.", "title": "Predicting Trust Dynamics Type Using Seven Personal Characteristics", "authers": [{"author_name": "Hyesun Chung", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Chung,+H"}, {"author_name": "X. Jessie Yang", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Yang,+X+J"}], "journal_ref": null, "subjects": ["Human-Computer Interaction (cs.HC)"], "links": {"abstract": "https://arxiv.org/abs/2409.07406", "pdf": "https://arxiv.org/pdf/2409.07406", "html": "https://arxiv.org/html/2409.07406v2", "other": "https://arxiv.org/format/2409.07406"}, "abstract": "This study aims to explore the associations between individuals' trust dynamics in automated/autonomous technologies and their personal characteristics, and to further examine whether personal characteristics can be used to predict a user's trust dynamics type. We conducted a human-subject experiment (N=130) in which participants performed a simulated surveillance task assisted by an automated threat detector. Using a pre-experimental survey covering 12 constructs and 28 dimensions, we collected data on participants' personal characteristics. Based on the experimental data, we performed k-means clustering and identified three trust dynamics types. Subsequently, we conducted one-way Analyses of Variance to evaluate differences among the three trust dynamics types in terms of personal characteristics, behaviors, performance, and post-experimental ratings. Participants were clustered into three groups, namely Bayesian decision makers, disbelievers, and oscillators. Results showed that the clusters differ significantly in seven personal characteristics: masculinity, positive affect, extraversion, neuroticism, intellect, performance expectancy, and high expectations. The disbelievers tend to have high neuroticism and low performance expectancy. The oscillators tend to have higher scores in masculinity, positive affect, extraversion, and intellect. We also found significant differences in behaviors, performance, and post-experimental ratings across the three groups. The disbelievers are the least likely to blindly follow the recommendations made by the automated threat detector. Based on the significant personal characteristics, we developed a decision tree model to predict the trust dynamics type with an accuracy of 70%. This model offers promising implications for identifying individuals whose trust dynamics may deviate from a Bayesian pattern."}, {"id": "2409.18009", "relevance": "high", "reason": "Introducing LLMs into industrial automation exemplifies creative approaches in technology integration, aiming for more intuitive and adaptive human-machine interactions.", "title": "Control Industrial Automation System with Large Language Model Agents", "authers": [{"author_name": "Yuchen Xia", "author_url": "https://arxiv.org/search/eess?searchtype=author&query=Xia,+Y"}, {"author_name": "Nasser Jazdi", "author_url": "https://arxiv.org/search/eess?searchtype=author&query=Jazdi,+N"}, {"author_name": "Jize Zhang", "author_url": "https://arxiv.org/search/eess?searchtype=author&query=Zhang,+J"}, {"author_name": "Chaitanya Shah", "author_url": "https://arxiv.org/search/eess?searchtype=author&query=Shah,+C"}, {"author_name": "Michael Weyrich", "author_url": "https://arxiv.org/search/eess?searchtype=author&query=Weyrich,+M"}], "journal_ref": null, "subjects": ["Systems and Control (eess.SY)", " Artificial Intelligence (cs.AI)", " Human-Computer Interaction (cs.HC)", " Multiagent Systems (cs.MA)", " Robotics (cs.RO)"], "links": {"abstract": "https://arxiv.org/abs/2409.18009", "pdf": "https://arxiv.org/pdf/2409.18009", "html": null, "other": "https://arxiv.org/format/2409.18009"}, "abstract": "Traditional industrial automation systems require specialized expertise to operate and complex reprogramming to adapt to new processes. Large language models offer the intelligence to make them more flexible and easier to use. However, LLMs' application in industrial settings is underexplored. This paper introduces a framework for integrating LLMs to achieve end-to-end control of industrial automation systems. At the core of the framework are an agent system designed for industrial tasks, a structured prompting method, and an event-driven information modeling mechanism that provides real-time data for LLM inference. The framework supplies LLMs with real-time events on different context semantic levels, allowing them to interpret the information, generate production plans, and control operations on the automation system. It also supports structured dataset creation for fine-tuning on this downstream application of LLMs. Our contribution includes a formal system design, proof-of-concept implementation, and a method for generating task-specific datasets for LLM fine-tuning and testing. This approach enables a more adaptive automation system that can respond to spontaneous events, while allowing easier operation and configuration through natural language for more intuitive human-machine interaction. We provide demo videos and detailed data on GitHub:"}, {"id": "2506.11015", "relevance": "moderate", "reason": "Examining how reliance on AI impacts human cognition in terms of memory, indirectly relates to how people access and utilize creativity, even though it isn't the main focus of the paper.", "title": "The Memory Paradox: Why Our Brains Need Knowledge in an Age of AI", "authers": [{"author_name": "Barbara Oakley", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Oakley,+B"}, {"author_name": "Michael Johnston", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Johnston,+M"}, {"author_name": "Ken-Zen Chen", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Chen,+K"}, {"author_name": "Eulho Jung", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Jung,+E"}, {"author_name": "Terrence J. Sejnowski", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Sejnowski,+T+J"}], "journal_ref": null, "subjects": ["Computers and Society (cs.CY)", " Artificial Intelligence (cs.AI)", " Human-Computer Interaction (cs.HC)", " Neurons and Cognition (q-bio.NC)"], "links": {"abstract": "https://arxiv.org/abs/2506.11015", "pdf": "https://arxiv.org/pdf/2506.11015", "html": null, "other": "https://arxiv.org/format/2506.11015"}, "abstract": "In the age of generative AI and ubiquitous digital tools, human cognition faces a structural paradox: as external aids become more capable, internal memory systems risk atrophy. Drawing on neuroscience and cognitive psychology, this paper examines how heavy reliance on AI systems and discovery-based pedagogies may impair the consolidation of declarative and procedural memory -- systems essential for expertise, critical thinking, and long-term retention. We review how tools like ChatGPT and calculators can short-circuit the retrieval, error correction, and schema-building processes necessary for robust neural encoding. Notably, we highlight striking parallels between deep learning phenomena such as \"grokking\" and the neuroscience of overlearning and intuition. Empirical studies are discussed showing how premature reliance on AI during learning inhibits proceduralization and intuitive mastery. We argue that effective human-AI interaction depends on strong internal models -- biological \"schemata\" and neural manifolds -- that enable users to evaluate, refine, and guide AI output. The paper concludes with policy implications for education and workforce training in the age of large language models."}, {"id": "2506.11376", "relevance": "high", "reason": "Using LLM-powered conversational agents to deliver therapeutic support involves creative elements in mental health treatment design, reflecting high relevance to creativity.", "title": "Large Language Model-Powered Conversational Agent Delivering Problem-Solving Therapy (PST) for Family Caregivers: Enhancing Empathy and Therapeutic Alliance Using In-Context Learning", "authers": [{"author_name": "Liying Wang", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Wang,+L"}, {"author_name": "Ph.D.", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Ph.D."}, {"author_name": "Daffodil Carrington", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Carrington,+D"}, {"author_name": "M.S.", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=M.S."}, {"author_name": "Daniil Filienko", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Filienko,+D"}, {"author_name": "M.S.", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=M.S."}, {"author_name": "Caroline El Jazmi", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Jazmi,+C+E"}, {"author_name": "M.S.", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=M.S."}, {"author_name": "Serena Jinchen Xie", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Xie,+S+J"}, {"author_name": "M.S.", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=M.S."}, {"author_name": "Martine De Cock", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=De+Cock,+M"}, {"author_name": "Ph.D.", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Ph.D."}, {"author_name": "Sarah Iribarren", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Iribarren,+S"}, {"author_name": "Ph.D.", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Ph.D."}, {"author_name": "Weichao Yuwen", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Yuwen,+W"}, {"author_name": "Ph.D", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Ph.D"}], "journal_ref": null, "subjects": ["Artificial Intelligence (cs.AI)", " Computation and Language (cs.CL)", " Human-Computer Interaction (cs.HC)"], "links": {"abstract": "https://arxiv.org/abs/2506.11376", "pdf": "https://arxiv.org/pdf/2506.11376", "html": null, "other": "https://arxiv.org/format/2506.11376"}, "abstract": "Family caregivers often face substantial mental health challenges due to their multifaceted roles and limited resources. This study explored the potential of a large language model (LLM)-powered conversational agent to deliver evidence-based mental health support for caregivers, specifically Problem-Solving Therapy (PST) integrated with Motivational Interviewing (MI) and Behavioral Chain Analysis (BCA). A within-subject experiment was conducted with 28 caregivers interacting with four LLM configurations to evaluate empathy and therapeutic alliance. The best-performing models incorporated Few-Shot and Retrieval-Augmented Generation (RAG) prompting techniques, alongside clinician-curated examples. The models showed improved contextual understanding and personalized support, as reflected by qualitative responses and quantitative ratings on perceived empathy and therapeutic alliances. Participants valued the model's ability to validate emotions, explore unexpressed feelings, and provide actionable strategies. However, balancing thorough assessment with efficient advice delivery remains a challenge. This work highlights the potential of LLMs in delivering empathetic and tailored support for family caregivers."}, {"id": "2506.12008", "relevance": "high", "reason": "The system enables dancers to co-create music with AI in real-time, which directly involves creativity in dance and music, showcasing a strong connection to creativity in the arts.", "title": "Reimagining Dance: Real-time Music Co-creation between Dancers and AI", "authers": [{"author_name": "Olga Vechtomova", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Vechtomova,+O"}, {"author_name": "Jeff Bos", "author_url": "https://arxiv.org/search/cs?searchtype=author&query=Bos,+J"}], "journal_ref": null, "subjects": ["Sound (cs.SD)", " Artificial Intelligence (cs.AI)", " Human-Computer Interaction (cs.HC)", " Audio and Speech Processing (eess.AS)"], "links": {"abstract": "https://arxiv.org/abs/2506.12008", "pdf": "https://arxiv.org/pdf/2506.12008", "html": "https://arxiv.org/html/2506.12008v1", "other": "https://arxiv.org/format/2506.12008"}, "abstract": "Dance performance traditionally follows a unidirectional relationship where movement responds to music. While AI has advanced in various creative domains, its application in dance has primarily focused on generating choreography from musical input. We present a system that enables dancers to dynamically shape musical environments through their movements. Our multi-modal architecture creates a coherent musical composition by intelligently combining pre-recorded musical clips in response to dance movements, establishing a bidirectional creative partnership where dancers function as both performers and composers. Through correlation analysis of performance data, we demonstrate emergent communication patterns between movement qualities and audio features. This approach reconceptualizes the role of AI in performing arts as a responsive collaborator that expands possibilities for both professional dance performance and improvisational artistic expression across broader populations."}]