{
  "data": [
    {
      "id": "2507.15692",
      "abstract": "Multimodal large language models (MLLMs) provide new opportunities for blind and low vision (BLV) people to access visual information in their daily lives. However, these models often produce errors that are difficult to detect without sight, posing safety and social risks in scenarios from medication identification to outfit selection. While BLV MLLM users use creative workarounds such as cross-checking between tools and consulting sighted individuals, these approaches are often time-consuming and impractical. We explore how systematically surfacing variations across multiple MLLM responses can support BLV users to detect unreliable information without visually inspecting the image. We contribute a design space for eliciting and presenting variations in MLLM descriptions, a prototype system implementing three variation presentation styles, and findings from a user study with 15 BLV participants. Our results demonstrate that presenting variations significantly increases users' ability to identify unreliable claims (by 4.9x using our approach compared to single descriptions) and significantly decreases perceived reliability of MLLM responses. 14 of 15 participants preferred seeing variations of MLLM responses over a single description, and all expressed interest in using our system for tasks from understanding a tornado's path to posting an image on social media.",
      "authors": [
        "Meng Chen",
        "Akhil Iyer",
        "Amy Pavel"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-21T14:59:50+00:00",
          "link": "https://arxiv.org/abs/2507.15692v1",
          "size": "5060kb",
          "version": "v1"
        }
      ],
      "title": "Surfacing Variations to Calibrate Perceived Reliability of MLLM-generated Image Descriptions",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.15692",
        "HTML": "https://arxiv.org/html/2507.15692",
        "PDF": "https://arxiv.org/pdf/2507.15692"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "partial",
        "reason": "While it mainly focuses on reliability in BLVs using MLLM-generated descriptions, the mention of creative workarounds indicates a secondary theme of creativity in overcoming challenges."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14217",
      "abstract": "We address the pattern explosion problem in pattern mining by proposing an interactive learning framework that combines nonlinear utility aggregation with geometry-aware query selection. Our method models user preferences through a Choquet integral over multiple interestingness measures and exploits the geometric structure of the version space to guide the selection of informative comparisons. A branch-and-bound strategy with tight distance bounds enables efficient identification of queries near the decision boundary. Experiments on UCI datasets show that our approach outperforms existing methods such as ChoquetRank, achieving better ranking accuracy with fewer user interactions.",
      "authors": [
        "Tudor Matei Opran",
        "Samir Loudni"
      ],
      "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
      "subjects": [
        "Machine Learning (cs.LG)",
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-16T07:41:45+00:00",
          "link": "https://arxiv.org/abs/2507.14217v1",
          "size": "505kb",
          "version": "v1"
        }
      ],
      "title": "Geometry-Aware Active Learning of Pattern Rankings via Choquet-Based Aggregation",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14217",
        "HTML": "https://arxiv.org/html/2507.14217",
        "PDF": "https://arxiv.org/pdf/2507.14217"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "partial",
        "reason": "The paper tackles pattern mining and preference modeling, which can relate to creativity in terms of discovery and exploration of patterns, but it is not the primary focus of the research."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.00286",
      "abstract": "Blind and low vision (BLV) individuals use Generative AI (GenAI) tools to interpret and manage visual content in their daily lives. While such tools can enhance the accessibility of visual content and so enable greater user independence, they also introduce complex challenges around visual privacy. In this paper, we investigate the current practices and future design preferences of blind and low vision individuals through an interview study with 21 participants. Our findings reveal a range of current practices with GenAI that balance privacy, efficiency, and emotional agency, with users accounting for privacy risks across six key scenarios, such as self-presentation, indoor/outdoor spatial privacy, social sharing, and handling professional content. Our findings reveal design preferences, including on-device processing, zero-retention guarantees, sensitive content redaction, privacy-aware appearance indicators, and multimodal tactile mirrored interaction methods. We conclude with actionable design recommendations to support user-centered visual privacy through GenAI, expanding the notion of privacy and responsible handling of others data.",
      "authors": [
        "Tanusree Sharma",
        "Yu-Yun Tseng",
        "Lotus Zhang",
        "Ayae Ide",
        "Kelly Avery Mack",
        "Leah Findlater",
        "Danna Gurari",
        "Yang Wang"
      ],
      "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)",
        "Artificial Intelligence (cs.AI)",
        "Emerging Technologies (cs.ET)"
      ],
      "submission_historys": [
        {
          "date": "2025-06-30T21:55:21+00:00",
          "link": "https://arxiv.org/abs/2507.00286v1",
          "size": "3283kb",
          "version": "v1"
        },
        {
          "date": "2025-07-19T04:31:05+00:00",
          "link": "https://arxiv.org/abs/2507.00286v2",
          "size": "3282kb",
          "version": "v2"
        }
      ],
      "title": "\"Before, I Asked My Mom, Now I Ask ChatGPT\": Visual Privacy Management with Generative AI for Blind and Low-Vision People",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.00286",
        "HTML": "https://arxiv.org/html/2507.00286",
        "PDF": "https://arxiv.org/pdf/2507.00286"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "partial",
        "reason": "The paper includes discussion on GenAI tools that could facilitate creative processes in managing visual content, particularly for blind and low-vision individuals, thus relating to creativity as a secondary theme."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.15081",
      "abstract": "Social isolation can lead to pervasive health issues like anxiety and loneliness. Previous work focused on physical interventions like exercise and teleconferencing, but overlooked the narrative potential of adaptive strategies. To address this, we designed a collaborative online storytelling experience in social VR, enabling participants in isolation to design an imaginary space journey as a metaphor for quarantine, in order to learn about their isolation adaptation strategies in the process. Eighteen individuals participated during real quarantine undertaken a virtual role-play experience, designing their own spaceship rooms and engaging in collaborative activities that revealed creative adaptative strategies. Qualitative analyses of participant designs, transcripts, and interactions revealed how they coped with isolation, and how the engagement unexpectedly influenced their adaptation process. This study shows how designing playful narrative experiences, rather than solution-driven approaches, can serve as probes to surface how people navigate social isolation.",
      "authors": [
        "Qi Gong",
        "Ximing Shen",
        "Ziyou Yin",
        "Yaning Li",
        "Ray Lc"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-20T18:31:22+00:00",
          "link": "https://arxiv.org/abs/2507.15081v1",
          "size": "8947kb",
          "version": "v1"
        }
      ],
      "title": "\"If I were in Space\": Understanding and Adapting to Social Isolation through Designing Collaborative Narratives",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.15081",
        "HTML": "https://arxiv.org/html/2507.15081",
        "PDF": "https://arxiv.org/pdf/2507.15081"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "core",
        "reason": "The paper centers on designing a collaborative storytelling experience to explore creative adaptation strategies during social isolation. Creativity is a primary focus as participants engage in creative tasks like designing spaceship rooms and participate in role-play, influencing their adaptation processes."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.15559",
      "abstract": "Multi-agent workflows have become an effective strategy for tackling complicated tasks by decomposing them into multiple sub-tasks and assigning them to specialized agents. However, designing optimal workflows remains challenging due to the vast and intricate design space. Current practices rely heavily on the intuition and expertise of practitioners, often resulting in design fixation or an unstructured, time-consuming exploration of trial-and-error. To address these challenges, this work introduces FLOWFORGE, an interactive visualization tool to facilitate the creation of multi-agent workflow through i) a structured visual exploration of the design space and ii) in-situ guidance informed by established design patterns. Based on formative studies and literature review, FLOWFORGE organizes the workflow design process into three hierarchical levels (i.e., task planning, agent assignment, and agent optimization), ranging from abstract to concrete. This structured visual exploration enables users to seamlessly move from high-level planning to detailed design decisions and implementations, while comparing alternative solutions across multiple performance metrics. Additionally, drawing from established workflow design patterns, FLOWFORGE provides context-aware, in-situ suggestions at each level as users navigate the design space, enhancing the workflow creation process with practical guidance. Use cases and user studies demonstrate the usability and effectiveness of FLOWFORGE, while also yielding valuable insights into how practitioners explore design spaces and leverage guidance during workflow development.",
      "authors": [
        "Pan Hao",
        "Dongyeop Kang",
        "Nicholas Hinds",
        "Qianwen Wang"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-21T12:39:08+00:00",
          "link": "https://arxiv.org/abs/2507.15559v1",
          "size": "5405kb",
          "version": "v1"
        }
      ],
      "title": "FlowForge: Guiding the Creation of Multi-agent Workflows with Design Space Visualization as a Thinking Scaffold",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.15559",
        "HTML": "https://arxiv.org/html/2507.15559",
        "PDF": "https://arxiv.org/pdf/2507.15559"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "core",
        "reason": "The paper's focus is on guiding the creation of multi-agent workflows using design space visualization, enhancing creativity in workflow design through structured exploration and guidance."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.08006",
      "abstract": "The growing resolution and volume of climate data from remote sensing and simulations pose significant storage, processing, and computational challenges. Traditional compression or subsampling methods often compromise data fidelity, limiting scientific insights. We introduce a scalable ecosystem that integrates hierarchical multiresolution data management, intelligent transmission, and ML-assisted reconstruction to balance accuracy and efficiency. Our approach reduces storage and computational costs by 99\\%, lowering expenses from \\$100,000 to \\$24 while maintaining a Root Mean Square (RMS) error of 1.46 degrees Celsius. Our experimental results confirm that even with significant data reduction, essential features required for accurate climate analysis are preserved. Validated on petascale NASA climate datasets, this solution enables cost-effective, high-fidelity climate analysis for research and decision-making.",
      "authors": [
        "Aashish Panta",
        "Amy Gooch",
        "Giorgio Scorzelli",
        "Michela Taufer",
        "Valerio Pascucci"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Atmospheric and Oceanic Physics (physics.ao-ph)",
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-06-25T17:55:37+00:00",
          "link": "https://arxiv.org/abs/2507.08006v1",
          "size": "4014kb",
          "version": "v1"
        }
      ],
      "title": "Scalable Climate Data Analysis: Balancing Petascale Fidelity and Computational Cost",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.08006",
        "HTML": "https://arxiv.org/html/2507.08006",
        "PDF": "https://arxiv.org/pdf/2507.08006"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper focuses on scalable climate data analysis and computational efficiency in handling large datasets, with no mention or focus on creativity or creative processes."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14685",
      "abstract": "The rapid growth and availability of event sequence data across domains requires effective analysis and exploration methods to facilitate decision-making. Visual analytics combines computational techniques with interactive visualizations, enabling the identification of patterns, anomalies, and attribute interactions. However, existing approaches frequently overlook the interplay between temporal and multivariate attributes. We introduce EventBox, a novel data representation and visual encoding approach for analyzing groups of events and their multivariate attributes. We have integrated EventBox into Sequen-C, a visual analytics system for the analysis of event sequences. To enable the agile creation of EventBoxes in Sequen-C, we have added user-driven transformations, including alignment, sorting, substitution and aggregation. To enhance analytical depth, we incorporate automatically generated statistical analyses, providing additional insight into the significance of attribute interactions. We evaluated our approach involving 21 participants (3 domain experts, 18 novice data analysts). We used the ICE-T framework to assess visualization value, user performance metrics completing a series of tasks, and interactive sessions with domain experts. We also present three case studies with real-world healthcare data demonstrating how EventBox and its integration into Sequen-C reveal meaningful patterns, anomalies, and insights. These results demonstrate that our work advances visual analytics by providing a flexible solution for exploring temporal and multivariate attributes in event sequences.",
      "authors": [
        "Luis Montana",
        "Jessica Magallanes",
        "Miguel Juarez",
        "Suzanne Mason",
        "Andrew Narracott",
        "Lindsey van Gemeren",
        "Steven Wood",
        "Maria-Cruz Villa-Uriol"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-19T16:28:37+00:00",
          "link": "https://arxiv.org/abs/2507.14685v1",
          "size": "6086kb",
          "version": "v1"
        }
      ],
      "title": "EventBox: A Novel Visual Encoding for Interactive Analysis of Temporal and Multivariate Attributes in Event Sequences",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14685",
        "HTML": "https://arxiv.org/html/2507.14685",
        "PDF": "https://arxiv.org/pdf/2507.14685"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper focuses on the development of visual analytics tools for event sequence data analysis. It does not address creativity or creative processes as part of its research scope."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.15244",
      "abstract": "Empirical research in creative design deepens our theoretical understanding of design principles and perceptual effects, offering valuable guidance for innovating creation tools. However, how these empirical insights currently influence the development of creation tools, and how their integration can be enhanced in the future, remains insufficiently understood. In this paper, we aim to unveil the gap through a case study on data videos, a prominent and wide-spread medium for effective data storytelling. To achieve the goal, we conducted a comprehensive analysis of 46 empirical research papers and 48 creation tool papers on data video, complemented by interviews with 11 experts. Building upon a systematic collection and structured characterization of empirical research by their methodologies (e.g., corpus analysis, comparative evaluations) and component focus (e.g., visuals, motions, narratives, audio), we conducted a context-aware citation analysis and revealed a taxonomy of recurring patterns in how empirical findings inform tool design across citation functions (e.g., problem framing, technical reference). Expert interviews further uncovered researchers' practice patterns in applying empirical findings (e.g., adaptation, synthesis, iteration, etc.) and identified key factors influencing applicability, such as contextual relevance, granularity matching, clarity, credibility, and feasibility. Finally, we derive suggestions and discuss future opportunities to foster closer mutual engagement between empirical and tool research, aiming to reinforce the theoretical grounding of creation tools and enhance the practical impact of empirical research.",
      "authors": [
        "Leixian Shen",
        "Leni Yang",
        "Haotian Li",
        "Yun Wang",
        "Yuyu Luo",
        "Huamin Qu"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-21T05:02:27+00:00",
          "link": "https://arxiv.org/abs/2507.15244v1",
          "size": "1662kb",
          "version": "v1"
        }
      ],
      "title": "How Does Empirical Research Facilitate Creation Tool Design? A Data Video Perspective",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.15244",
        "HTML": "https://arxiv.org/html/2507.15244",
        "PDF": "https://arxiv.org/pdf/2507.15244"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "partial",
        "reason": "This paper explores the role of empirical research in designing creation tools, specifically data videos. Creativity is a secondary theme as it discusses design principles influencing creation tools, relating indirectly to creative processes and storytelling."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14553",
      "abstract": "Clutter in photos is a distraction preventing photographers from conveying the intended emotions or stories to the audience. Photography amateurs frequently include clutter in their photos due to unconscious negligence or the lack of experience in creating a decluttered, aesthetically appealing scene for shooting. We are thus motivated to develop a camera guidance system that provides solutions and guidance for clutter identification and removal. We estimate and visualize the contribution of objects to the overall aesthetics and content of a photo, based on which users can interactively identify clutter. Suggestions on getting rid of clutter, as well as a tool that removes cluttered objects computationally, are provided to guide users to deal with different kinds of clutter and improve their photographic work. Two technical novelties underpin interactions in our system: a clutter distinguishment algorithm with aesthetics evaluations for objects and an iterative image inpainting algorithm based on generative adversarial nets that reconstructs missing regions of removed objects for high-resolution images. User studies demonstrate that our system provides flexible interfaces and accurate algorithms that allow users to better identify distractions and take higher quality images within less time.",
      "authors": [
        "Xiaoran Wu"
      ],
      "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
      "subjects": [
        "Computer Vision and Pattern Recognition (cs.CV)",
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-19T09:15:17+00:00",
          "link": "https://arxiv.org/abs/2507.14553v1",
          "size": "15499kb",
          "version": "v1"
        }
      ],
      "title": "Clutter Detection and Removal by Multi-Objective Analysis for Photographic Guidance",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14553",
        "HTML": "https://arxiv.org/html/2507.14553",
        "PDF": "https://arxiv.org/pdf/2507.14553"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "partial",
        "reason": "The paper discusses a system aimed at improving photographic work by decluttering images, which indirectly supports creative activities (photography). While creativity itself is not the primary focus, it's an important aspect of the problem being addressed."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14173",
      "abstract": "Human computer interaction has become integral to modern life, driven by advancements in machine learning technologies. Affective computing, in particular, has focused on systems that recognize, interpret, and respond to human emotions, often using wearable devices, which provide continuous data streams of physiological signals. Among various physiological signals, the photoplethysmogram (PPG) has gained prominence due to its ease of acquisition from widely available devices. However, the generalization of PPG-based emotion recognition models across individuals remains an unresolved challenge. This paper introduces a novel hybrid architecture that combines Convolutional Neural Networks (CNNs), Long Short-Term Memory networks (LSTMs), and Temporal Convolutional Networks (TCNs) to address this issue. The proposed model integrates the strengths of these architectures to improve robustness and generalization. Raw PPG signals are fed into the CNN for feature extraction. These features are processed separately by LSTM and TCN. The outputs from these components are concatenated to generate a final feature representation, which serves as the input for classifying valence and arousal, the primary dimensions of emotion. Experiments using the Photoplethysmogram Dataset for Emotional Analysis (PPGE) demonstrate that the proposed hybrid model achieves better model generalization than standalone CNN and LSTM architectures. Our results show that the proposed solution outperforms the state-of-the-art CNN architecture, as well as a CNN-LSTM model, in emotion recognition tasks with PPG signals. Using metrics such as Area Under the Curve (AUC) and F1 Score, we highlight the model's effectiveness in handling subject variability.",
      "authors": [
        "Karim Alghoul",
        "Hussein Al Osman",
        "Abdulmotaleb El Saddik"
      ],
      "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
      "subjects": [
        "Signal Processing (eess.SP)",
        "Human-Computer Interaction (cs.HC)",
        "Machine Learning (cs.LG)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-10T16:30:44+00:00",
          "link": "https://arxiv.org/abs/2507.14173v1",
          "size": "586kb",
          "version": "v1"
        }
      ],
      "title": "Enhancing Generalization in PPG-Based Emotion Measurement with a CNN-TCN-LSTM Model",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14173",
        "PDF": "https://arxiv.org/pdf/2507.14173"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "This paper discusses emotion measurement using physiological data and machine learning models, emphasizing generalization and robustness in emotion recognition, without relating to creativity."
      },
      "source": "arXiv"
    },
    {
      "id": "2504.03253",
      "abstract": "Wireless mouse rings offer subtle, reliable pointing interactions for wearable computing platforms. However, the small battery below 27 mAh in the miniature rings restricts the ring's continuous lifespan to just 1-10 hours, because current low-powered wireless communication such as BLE is power-consuming for ring's continuous use. The ring's short lifespan frequently disrupts users' mouse use with the need for frequent charging. This paper presents picoRing mouse, enabling a continuous ring-based mouse interaction with ultra-low-powered ring-to-wristband wireless communication. picoRing mouse employs a coil-based impedance sensing named semi-passive inductive telemetry, allowing a wristband coil to capture a unique frequency response of a nearby ring coil via a sensitive inductive coupling between the coils. The ring coil converts the corresponding user's mouse input into the unique frequency response via an up to 449 uW mouse-driven modulation system. Therefore, the continuous use of picoRing mouse can last approximately 600 (8hrs use/day)-1000 (4hrs use/day) hours on a single charge of a 27 mAh battery while supporting subtle thumb-to-index scrolling and pressing interactions in real-world wearable computing situations.",
      "authors": [
        "Yifan Li",
        "Masaaki Fukumoto",
        "Mohamed Kari",
        "Shigemi Ishida",
        "Akihito Noda",
        "Tomoyuki Yokota",
        "Takao Someya",
        "Yoshihiro Kawahara",
        "Ryo Takahashi"
      ],
      "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-04-04T08:09:16+00:00",
          "link": "https://arxiv.org/abs/2504.03253v1",
          "size": "6391kb",
          "version": "v1"
        },
        {
          "date": "2025-07-21T11:36:16+00:00",
          "link": "https://arxiv.org/abs/2504.03253v2",
          "size": "6107kb",
          "version": "v2"
        }
      ],
      "title": "Ultra-low-power ring-based wireless tinymouse",
      "links": {
        "Abstract": "https://arxiv.org/abs/2504.03253",
        "HTML": "https://arxiv.org/html/2504.03253",
        "PDF": "https://arxiv.org/pdf/2504.03253"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper discusses the technical aspects of a wireless mouse ring, focusing on power efficiency and usability, with no relation to creativity or creative tasks."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14792",
      "abstract": "Information processing tasks involve complex cognitive mechanisms that are shaped by various factors, including individual goals, prior experience, and system environments. Understanding such behaviors requires a sophisticated and personalized data capture of how one interacts with modern information systems (e.g., web search engines). Passive sensors, such as wearables, capturing physiological and behavioral data, have the potential to provide solutions in this context. This paper presents a novel dataset, SenseSeek, designed to evaluate the effectiveness of consumer-grade sensors in a complex information processing scenario: searching via systems (e.g., search engines), one of the common strategies users employ for information seeking. The SenseSeek dataset comprises data collected from 20 participants, 235 trials of the stimulated search process, 940 phases of stages in the search process, including the realization of Information Need (IN), Query Formulation (QF), Query Submission by Typing (QS-T) or Speaking (QS-S), and Relevance Judgment by Reading (RJ-R) or Listening (RJ-L). The data includes Electrodermal Activities (EDA), Electroencephalogram (EEG), PUPIL, GAZE, and MOTION data, which were captured using consumer-grade sensors. It also contains 258 features extracted from the sensor data, the gaze-annotated screen recordings, and task responses. We validate the usefulness of the dataset by providing baseline analysis on the impacts of different cognitive intents and interaction modalities on the sensor data, and effectiveness of the data in discriminating the search stages. To our knowledge, SenseSeek is the first dataset that characterizes the multiple stages involved in information seeking with physiological signals collected from multiple sensors. We hope this dataset can serve as a reference for future research on information-seeking behaviors.",
      "authors": [
        "Kaixin Ji",
        "Danula Hettiachchi",
        "Falk Scholer",
        "Flora D. Salim",
        "Damiano Spina"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-20T02:35:47+00:00",
          "link": "https://arxiv.org/abs/2507.14792v1",
          "size": "1884kb",
          "version": "v1"
        }
      ],
      "title": "SenseSeek Dataset: Multimodal Sensing to Study Information Seeking Behaviors",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14792",
        "HTML": "https://arxiv.org/html/2507.14792",
        "PDF": "https://arxiv.org/pdf/2507.14792"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The study revolves around understanding information-seeking behaviors using multimodal sensors, with no direct focus on creativity."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14702",
      "abstract": "Excessive use of smartphones is a worldwide known issue. In this study, we proposed a notification-based intervention approach to reduce smartphone overuse without making the user feel any annoyance or irritation. Most of the work in this field tried to reduce smartphone overuse by making smartphone use more difficult for the user. In our user study (n = 109), we found that 19.3% of the participants are unwilling to use any usage-limiting application because a) they do not want their smartphone activities to get restricted or b) those applications are annoying. Following that, we devised a hypothesis to minimize smartphone usage among undergraduates. Finally, we designed a prototype for Android, \"App Usage Monitor,\" and conducted a 3-week experiment through which we found proof of concept for our hypothesis. In our prototype, we combined techniques such as nudge and visualization to increase self-awareness among the user by leveraging notifications.",
      "authors": [
        "Partha Sarker",
        "Dipto Dey",
        "Marium-E-Jannat"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-19T17:39:48+00:00",
          "link": "https://arxiv.org/abs/2507.14702v1",
          "size": "1902kb",
          "version": "v1"
        }
      ],
      "title": "A Notification Based Nudge for Handling Excessive Smartphone Use",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14702",
        "HTML": "https://arxiv.org/html/2507.14702",
        "PDF": "https://arxiv.org/pdf/2507.14702"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper addresses the issue of excessive smartphone use and presents a notification-based intervention system. Creativity is not relevant to the research theme or objectives addressed."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.15041",
      "abstract": "In India, online news media outlets were an important source of information for people with digital access during the COVID-19 pandemic. In India, where \"transgender\" was legally recognised as a category only in 2014, and same-sex marriages are yet to be legalised, it becomes crucial to analyse whether and how they reported the lived realities of vulnerable LGBTQ+ communities during the pandemic. This study analysed articles from online editions of two English-language newspaper websites, which differed vastly in their circulation figures-The Times of India and The Indian Express. The results of our study suggest that these newspaper websites published articles surrounding various aspects of the lives of LGBTQ+ individuals with a greater focus on transgender communities. However, they lacked quality and depth. Focusing on the period spanning March 2020 to August 2021, we analysed articles using sentiment analysis and topic modelling. We also compared our results to the period before the pandemic (January 2019 - December 2019) to understand the shift in topics, sentiments, and stances across the two newspaper websites. A manual analysis of the articles indicated that the language used in certain articles by The Times of India was transphobic and obsolete. Our study captures the visibility and representation of the LGBTQ+ communities in Indian newspaper websites during the pandemic.",
      "authors": [
        "Dhruvee Birla",
        "Nazia Akhtar"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-20T16:45:38+00:00",
          "link": "https://arxiv.org/abs/2507.15041v1",
          "size": "673kb",
          "version": "v1"
        }
      ],
      "title": "Visibility vs. Engagement: How Two Indian News Websites Reported on LGBTQ+ Individuals and Communities during the Pandemic",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.15041",
        "HTML": "https://arxiv.org/html/2507.15041",
        "PDF": "https://arxiv.org/pdf/2507.15041"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper discusses media reporting on LGBTQ+ communities during the pandemic, without addressing creativity."
      },
      "source": "arXiv"
    },
    {
      "id": "2501.06348",
      "abstract": "Understanding the motivations underlying the human inclination to automate tasks is vital to developing truly helpful robots integrated into daily life. Accordingly, we ask: are individuals more inclined to automate chores based on the time they consume or the feelings experienced while performing them? This study explores these preferences and whether they vary across different social groups (i.e., gender category and income level). Leveraging data from the BEHAVIOR-1K dataset, the American Time-Use Survey, and the American Time-Use Survey Well-Being Module, we investigate the relationship between the desire for automation, time spent on daily activities, and their associated feelings - Happiness, Meaningfulness, Sadness, Painfulness, Stressfulness, or Tiredness. Our key findings show that, despite common assumptions, time spent does not strongly relate to the desire for automation for the general population. For the feelings analyzed, only happiness and pain are key indicators. Significant differences by gender and economic level also emerged: Women prefer to automate stressful activities, whereas men prefer to automate those that make them unhappy; mid-income individuals prioritize automating less enjoyable and meaningful activities, while low and high-income show no significant correlations. We hope our research helps motivate technologies to develop robots that match the priorities of potential users, moving domestic robotics toward more socially relevant solutions. We open-source all the data, including an online tool that enables the community to replicate our analysis and explore additional trends at https://hri1260.github.io/why-automate-this.",
      "authors": [
        "Ruchira Ray",
        "Leona Pang",
        "Sanjana Srivastava",
        "Li Fei-Fei",
        "Samantha Shorey",
        "Roberto Mart\\'in-Mart\\'in"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)",
        "Robotics (cs.RO)"
      ],
      "submission_historys": [
        {
          "date": "2025-01-10T21:20:11+00:00",
          "link": "https://arxiv.org/abs/2501.06348v1",
          "size": "2403kb",
          "version": "v1"
        },
        {
          "date": "2025-07-20T16:18:12+00:00",
          "link": "https://arxiv.org/abs/2501.06348v2",
          "size": "1860kb",
          "version": "v2"
        }
      ],
      "title": "Why Automate This? Exploring the Connection between Time Use, Well-being and Robot Automation Across Social Groups",
      "links": {
        "Abstract": "https://arxiv.org/abs/2501.06348",
        "PDF": "https://arxiv.org/pdf/2501.06348"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper explores automation preferences based on time use and well-being, without addressing creativity as a theme in its research aims or discussion."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14339",
      "abstract": "Brain foundation models represent a new frontier in AI: instead of processing text or images, these models interpret real-time neural signals from EEG, fMRI, and other neurotechnologies. When integrated with brain-computer interfaces (BCIs), they may enable transformative applications-from thought controlled devices to neuroprosthetics-by interpreting and acting on brain activity in milliseconds. However, these same systems pose unprecedented risks, including the exploitation of subconscious neural signals and the erosion of cognitive liberty. Users cannot easily observe or control how their brain signals are interpreted, creating power asymmetries that are vulnerable to manipulation. This paper proposes embedding fiduciary duties-loyalty, care, and confidentiality-directly into BCI-integrated brain foundation models through technical design. Drawing on legal traditions and recent advancements in AI alignment techniques, we outline implementable architectural and governance mechanisms to ensure these systems act in users' best interests. Placing brain foundation models on a fiduciary footing is essential to realizing their potential without compromising self-determination.",
      "authors": [
        "Abhishek Bhattacharjee",
        "Jack Pilkington",
        "Nita Farahany"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Computers and Society (cs.CY)",
        "Artificial Intelligence (cs.AI)",
        "Human-Computer Interaction (cs.HC)",
        "Machine Learning (cs.LG)",
        "Signal Processing (eess.SP)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-18T19:34:08+00:00",
          "link": "https://arxiv.org/abs/2507.14339v1",
          "size": "563kb",
          "version": "v1"
        }
      ],
      "title": "Fiduciary AI for the Future of Brain-Technology Interactions",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14339",
        "PDF": "https://arxiv.org/pdf/2507.14339"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper focuses on embedding fiduciary duties into brain-computer interface systems, addressing ethical and technical governance, without a direct focus on creativity."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.15049",
      "abstract": "Unmanned Aerial Vehicles are reshaping Non-Terrestrial Networks by acting as agile, intelligent nodes capable of advanced analytics and instantaneous situational awareness. This article introduces a budget-friendly quadcopter platform that unites 5G communications, edge-based processing, and AI to tackle core challenges in NTN scenarios. Outfitted with a panoramic camera, robust onboard computation, and LLMs, the drone system delivers seamless object recognition, contextual analysis, and immersive operator experiences through virtual reality VR technology. Field evaluations confirm the platform's ability to process visual streams with low latency and sustain robust 5G links. Adding LLMs further streamlines operations by extracting actionable insights and refining collected data for decision support. Demonstrated use cases, including emergency response, infrastructure assessment, and environmental surveillance, underscore the system's adaptability in demanding contexts.",
      "authors": [
        "Andres Navarro",
        "Carlos de Quinto",
        "and Jos\\'e Alberto Hern\\'andez"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-20T17:06:02+00:00",
          "link": "https://arxiv.org/abs/2507.15049v1",
          "size": "3288kb",
          "version": "v1"
        }
      ],
      "title": "Beyond Visual Line of Sight: UAVs with Edge AI, Connected LLMs, and VR for Autonomous Aerial Intelligence",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.15049",
        "HTML": "https://arxiv.org/html/2507.15049",
        "PDF": "https://arxiv.org/pdf/2507.15049"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper describes a UAV platform with edge AI and VR, focusing on technical capabilities rather than creativity."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14947",
      "abstract": "Echoes of the Land is an interactive installation that transforms seismic dynamics into a multisensory experience through a scientifically grounded spring-block model. Simulating earthquake recurrence and self-organized criticality, the work generates real-time sound and light via motion capture and concatenative granular synthesis. Each block acts as an agent, producing emergent audiovisual cascades that visualize the physics of rupture and threshold behavior. This work exemplifies the amalgamation of scientific knowledge and artistic practice, opening new avenues for novel forms of musical instrument and narrative medium, while inviting further investigation into the intersection of emergent complexity, aesthetics and interactivity.",
      "authors": [
        "Ivan C. H. Liu",
        "Chung-En Hao",
        "Jing Xie"
      ],
      "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)",
        "Adaptation and Self-Organizing Systems (nlin.AO)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-20T12:58:16+00:00",
          "link": "https://arxiv.org/abs/2507.14947v1",
          "size": "4473kb",
          "version": "v1"
        }
      ],
      "title": "Echoes of the Land: An Interactive Installation Based on Physical Model of Earthquake",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14947",
        "HTML": "https://arxiv.org/html/2507.14947",
        "PDF": "https://arxiv.org/pdf/2507.14947"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "core",
        "reason": "The paper describes an interactive installation that combines scientific knowledge and artistic practice. It uses creative processes to transform seismic dynamics into a multisensory experience, making creativity a primary focus."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14537",
      "abstract": "Understanding how the human brain encodes and processes external visual stimuli has been a fundamental challenge in neuroscience. With advancements in artificial intelligence, sophisticated visual decoding architectures have achieved remarkable success in fMRI research, enabling more precise and fine-grained spatial concept localization. This has provided new tools for exploring the spatial representation of concepts in the brain. However, despite the millisecond-scale temporal resolution of EEG, which offers unparalleled advantages in tracking the dynamic evolution of cognitive processes, the temporal dynamics of neural representations based on EEG remain underexplored. This is primarily due to EEG's inherently low signal-to-noise ratio and its complex spatiotemporal coupling characteristics. To bridge this research gap, we propose a novel approach that integrates advanced neural decoding algorithms to systematically investigate how low-dimensional object properties are temporally encoded in EEG signals. We are the first to attempt to identify the specificity and prototypical temporal characteristics of concepts within temporal distributions. Our framework not only enhances the interpretability of neural representations but also provides new insights into visual decoding in brain-computer interfaces (BCI).",
      "authors": [
        "Jiahua Tang",
        "Song Wang",
        "Jiachen Zou",
        "Chen Wei",
        "Quanying Liu"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-19T08:50:07+00:00",
          "link": "https://arxiv.org/abs/2507.14537v1",
          "size": "1999kb",
          "version": "v1"
        }
      ],
      "title": "Uncovering the EEG Temporal Representation of Low-dimensional Object Properties",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14537",
        "HTML": "https://arxiv.org/html/2507.14537",
        "PDF": "https://arxiv.org/pdf/2507.14537"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper concerns itself with neural representations of visual stimuli using EEG, with no apparent focus on creativity or creative processes."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14985",
      "abstract": "The rapid growth of metaverse technologies, including virtual worlds, augmented reality, and lifelogging, has accelerated their adoption across diverse domains. This rise exposes users to significant new security and privacy challenges due to sociotechnical complexity, pervasive connectivity, and extensive user data collection in immersive environments. We present a systematic review of the literature published between 2013 and 2024, offering a comprehensive analysis of how the research community has addressed metaverse-related security and privacy issues over the past decade. We organize the studies by method, examined the security and privacy properties, immersive components, and evaluation strategies. Our investigation reveals a sharp increase in research activity in the last five years, a strong focus on practical and user-centered approaches, and a predominant use of benchmarking, human experimentation, and qualitative methods. Authentication and unobservability are the most frequently studied properties. However, critical gaps remain in areas such as policy compliance, accessibility, interoperability, and back-end infrastructure security. We emphasize the intertwined technical complexity and human factors of the metaverse and call for integrated, interdisciplinary approaches to securing inclusive and trustworthy immersive environments.",
      "authors": [
        "Argianto Rahartomo",
        "Leonel Merino",
        "Mohammad Ghafari"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Cryptography and Security (cs.CR)",
        "Emerging Technologies (cs.ET)",
        "Human-Computer Interaction (cs.HC)",
        "Software Engineering (cs.SE)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-20T14:42:17+00:00",
          "link": "https://arxiv.org/abs/2507.14985v1",
          "size": "2684kb",
          "version": "v1"
        }
      ],
      "title": "Metaverse Security and Privacy Research: A Systematic Review",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14985",
        "HTML": "https://arxiv.org/html/2507.14985",
        "PDF": "https://arxiv.org/pdf/2507.14985"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper focuses on metaverse security and privacy, with no mention or connection to creativity."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.15481",
      "abstract": "Virtual Reality (VR) is often described as the \"ultimate empathy machine,\" framing disability as an experience to be simulated through such technologies, which can reduce disability to a spectacle of pity or inspiration. In response, we present Waiting for Hands (WfH), an interactive eXtended Reality (XR) installation that critiques this logic by: (1) repurposing interaction norms in XR through the creation of Alternative Controllers, and (2) staging an absurd XR performance using the built controllers to disrupt sentimentalized disability narratives. The performance involves eight people: two XR participants on stage and six audience members watching a projected documentary about Hema Kumari, an Indian singer living with Rheumatoid Arthritis. The XR users partially obscure the film, drawing attention through strange mouth and hand movements performed in XR. This creates a layered experience that disrupts direct engagement with Hema's story and introduces uncertainty. While XR is often seen as a fully immersive, sensory-dominant medium, this piece subverts that framing by using XR to produce absurdity and alienation. By challenging empathy-driven and pitiable narratives of disability, we ask what ethical stance an XR performance can take to attune participants to non-normative embodiment while resisting spectacle.",
      "authors": [
        "Yesica Duarte and Puneet Jain"
      ],
      "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-21T10:36:15+00:00",
          "link": "https://arxiv.org/abs/2507.15481v1",
          "size": "458kb",
          "version": "v1"
        }
      ],
      "title": "Challenging Disability and Interaction Norms in XR: Cooling Down the Empathy Machine in Waiting for Hands",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.15481",
        "PDF": "https://arxiv.org/pdf/2507.15481"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "core",
        "reason": "This work actively engages with creative processes by exploring XR performance with alternative controllers to disrupt conventional narratives. It critiques and challenges norms creatively, making creativity a primary focus of the research."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14767",
      "abstract": "Causality helps people reason about and understand complex systems, particularly through what-if analyses that explore how interventions might alter outcomes. Although existing methods embrace causal reasoning using interventions and counterfactual analysis, they primarily focus on effects at the population level. These approaches often fall short in systems characterized by significant heterogeneity, where the impact of an intervention can vary widely across subgroups. To address this challenge, we present XplainAct, a visual analytics framework that supports simulating, explaining, and reasoning interventions at the individual level within subpopulations. We demonstrate the effectiveness of XplainAct through two case studies: investigating opioid-related deaths in epidemiology and analyzing voting inclinations in the presidential election.",
      "authors": [
        "Yanming Zhang",
        "Krishnakumar Hegde",
        "Klaus Mueller"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)",
        "Artificial Intelligence (cs.AI)",
        "Machine Learning (cs.LG)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-19T22:57:09+00:00",
          "link": "https://arxiv.org/abs/2507.14767v1",
          "size": "1221kb",
          "version": "v1"
        }
      ],
      "title": "XplainAct: Visualization for Personalized Intervention Insights",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14767",
        "HTML": "https://arxiv.org/html/2507.14767",
        "PDF": "https://arxiv.org/pdf/2507.14767"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper focuses on a visual analytics framework for personalized intervention insights and does not directly address creativity as a research theme."
      },
      "source": "arXiv"
    },
    {
      "id": "2502.02883",
      "abstract": "Natural language interaction with sensing systems is crucial for addressing users' personal concerns and providing health-related insights into their daily lives. When a user asks a question, the system automatically analyzes the full history of sensor data, extracts relevant information, and generates an appropriate response. However, existing systems are limited to short-duration (e.g., one minute) or low-frequency (e.g., daily step count) sensor data. In addition, they struggle with quantitative questions that require precise numerical answers. In this work, we introduce SensorChat, the first end-to-end QA system designed for daily life monitoring using long-duration, high-frequency time series data. Given raw sensor signals spanning multiple days and a user-defined natural language question, SensorChat generates semantically meaningful responses that directly address user concerns. SensorChat effectively handles both quantitative questions that require numerical precision and qualitative questions that require high-level reasoning to infer subjective insights. To achieve this, SensorChat uses an innovative three-stage pipeline including question decomposition, sensor data query, and answer assembly. The first and third stages leverage Large Language Models (LLMs) to interpret human queries and generate responses. The intermediate querying stage extracts relevant information from the complete sensor data history. Real-world implementations demonstrate SensorChat's capability for real-time interactions on a cloud server while also being able to run entirely on edge platforms after quantization. Comprehensive QA evaluations show that SensorChat achieves 93% higher answer accuracy than the best performing state-of-the-art systems on quantitative questions. Furthermore, a user study with eight volunteers highlights SensorChat's effectiveness in answering qualitative questions.",
      "authors": [
        "Xiaofan Yu",
        "Lanxiang Hu",
        "Benjamin Reichman",
        "Dylan Chu",
        "Rushil Chandrupatla",
        "Xiyuan Zhang",
        "Larry Heck",
        "Tajana Rosing"
      ],
      "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "subjects": [
        "Artificial Intelligence (cs.AI)",
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-02-05T04:41:59+00:00",
          "link": "https://arxiv.org/abs/2502.02883v1",
          "size": "10565kb",
          "version": "v1"
        },
        {
          "date": "2025-05-15T06:31:41+00:00",
          "link": "https://arxiv.org/abs/2502.02883v2",
          "size": "12752kb",
          "version": "v2"
        },
        {
          "date": "2025-07-18T23:00:52+00:00",
          "link": "https://arxiv.org/abs/2502.02883v3",
          "size": "5816kb",
          "version": "v3"
        }
      ],
      "title": "SensorChat: Answering Qualitative and Quantitative Questions during Long-Term Multimodal Sensor Interactions",
      "links": {
        "Abstract": "https://arxiv.org/abs/2502.02883",
        "HTML": "https://arxiv.org/html/2502.02883",
        "PDF": "https://arxiv.org/pdf/2502.02883"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "SensorChat focuses on natural language interaction with sensor systems for personal and health insights, which does not involve creativity or creative processes."
      },
      "tasks": [
        "Quantization",
        "Question Answering"
      ],
      "source": "arXiv"
    },
    {
      "id": "2503.05609",
      "abstract": "Ensuring the safety of Generative AI requires a nuanced understanding of pluralistic viewpoints. In this paper, we introduce a novel data-driven approach for interpreting granular ratings in pluralistic datasets. Specifically, we address the challenge of analyzing nuanced differences in safety feedback from a diverse population expressed via ordinal scales (e.g., a Likert scale). We distill non-parametric responsiveness metrics that quantify the consistency of raters in scoring varying levels of the severity of safety violations. Leveraging a publicly available pluralistic dataset of safety feedback on AI-generated content as our case study, we investigate how raters from different demographic groups (age, gender, ethnicity) use an ordinal scale to express their perceptions of the severity of violations. We apply our metrics across violation types, demonstrating their utility in extracting nuanced insights that are crucial for aligning AI systems reliably in multi-cultural contexts. We show that our approach can inform rater selection and feedback interpretation by capturing nuanced viewpoints across different demographic groups, hence improving the quality of pluralistic data collection and in turn contributing to more robust AI development.",
      "authors": [
        "Pushkar Mishra",
        "Charvi Rastogi",
        "Stephen R. Pfohl",
        "Alicia Parrish",
        "Tian Huey Teh",
        "Roma Patel",
        "Mark Diaz",
        "Ding Wang",
        "Michela Paganini",
        "Vinodkumar Prabhakaran",
        "Lora Aroyo",
        "Verena Rieser"
      ],
      "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
      "subjects": [
        "Computers and Society (cs.CY)",
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-03-07T17:32:31+00:00",
          "link": "https://arxiv.org/abs/2503.05609v1",
          "size": "1906kb",
          "version": "v1"
        },
        {
          "date": "2025-06-23T10:34:20+00:00",
          "link": "https://arxiv.org/abs/2503.05609v2",
          "size": "2164kb",
          "version": "v2"
        },
        {
          "date": "2025-07-07T17:28:24+00:00",
          "link": "https://arxiv.org/abs/2503.05609v3",
          "size": "2164kb",
          "version": "v3"
        },
        {
          "date": "2025-07-20T10:38:03+00:00",
          "link": "https://arxiv.org/abs/2503.05609v4",
          "size": "2164kb",
          "version": "v4"
        }
      ],
      "title": "Decoding Safety Feedback from Diverse Raters: A Data-driven Lens on Responsiveness to Severity",
      "links": {
        "Abstract": "https://arxiv.org/abs/2503.05609",
        "HTML": "https://arxiv.org/html/2503.05609",
        "PDF": "https://arxiv.org/pdf/2503.05609"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "This paper addresses safety feedback in AI systems, emphasizing cultural and demographic perceptions; creativity is not discussed as part of the research."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.15033",
      "abstract": "Social media was one of the most popular forms of communication among young people with digital access during the pandemic. Consequently, crucial debates and discussions about the pandemic crisis have also developed on social media platforms, making them a great primary source to study the experiences of specific groups and communities during the pandemic. This study involved research using LDA topic modeling and sentiment analysis on data obtained from the social media platform Reddit to understand the themes and attitudes in circulation within five subreddits devoted to LGBTQ+ experiences and issues. In the process, we attempt to make sense of the role that Reddit may have played in the lives of LGBTQ+ people who were online during the pandemic, and whether this was marked by any continuities or discontinuities from before the pandemic period.",
      "authors": [
        "Dhruvee Birla",
        "Nazia Akhtar"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-20T16:35:37+00:00",
          "link": "https://arxiv.org/abs/2507.15033v1",
          "size": "103kb",
          "version": "v1"
        }
      ],
      "title": "'A Little Bubble of Friends': An Analysis of LGBTQ+ Pandemic Experiences Using Reddit Data",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.15033",
        "HTML": "https://arxiv.org/html/2507.15033",
        "PDF": "https://arxiv.org/pdf/2507.15033"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper analyzes LGBTQ+ pandemic experiences using Reddit data, which does not relate to creativity as a theme."
      },
      "source": "arXiv"
    },
    {
      "id": "2506.11092",
      "abstract": "Retrieval-Augmented Generation (RAG) has significantly advanced large language models (LLMs) by grounding their outputs in external tools and knowledge sources. However, existing RAG systems are typically constrained to static, single-turn interactions with fixed toolsets, making them ill-suited for dynamic domains such as healthcare and smart homes, where user intent, available tools, and contextual factors evolve over time. We present Dynamic Context Tuning (DCT), a lightweight framework that extends RAG to support multi-turn dialogue and evolving tool environments without requiring retraining. DCT integrates an attention-based context cache to track relevant past information, LoRA-based retrieval to dynamically select domain-specific tools, and efficient context compression to maintain inputs within LLM context limits. Experiments on both synthetic and real-world benchmarks show that DCT improves plan accuracy by 14% and reduces hallucinations by 37%, while matching GPT-4 performance at significantly lower cost. Furthermore, DCT generalizes to previously unseen tools, enabling scalable and adaptable AI assistants across a wide range of dynamic environments.",
      "authors": [
        "Jubin Abhishek Soni",
        "Amit Anand",
        "Rajesh Kumar Pandey",
        "Aniket Abhishek Soni"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Computation and Language (cs.CL)",
        "Artificial Intelligence (cs.AI)",
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-06-05T19:47:22+00:00",
          "link": "https://arxiv.org/abs/2506.11092v1",
          "size": "341kb",
          "version": "v1"
        },
        {
          "date": "2025-07-19T17:46:19+00:00",
          "link": "https://arxiv.org/abs/2506.11092v2",
          "size": "0kb",
          "version": "v2"
        }
      ],
      "title": "Dynamic Context Tuning for Retrieval-Augmented Generation: Enhancing Multi-Turn Planning and Tool Adaptation",
      "links": {
        "Abstract": "https://arxiv.org/abs/2506.11092",
        "HTML": "https://arxiv.org/html/2506.11092",
        "PDF": "https://arxiv.org/pdf/2506.11092"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper focuses on enhancing retrieval-augmented generation for LLMs in dynamic domains, but does not address creativity directly or indirectly within its scope."
      },
      "tasks": [
        "RAG",
        "Retrieval",
        "Retrieval-augmented Generation"
      ],
      "source": "arXiv"
    },
    {
      "id": "2507.15202",
      "abstract": "Millions of people listen to podcasts, audio stories, and lectures, but editing speech remains tedious and time-consuming. Creators remove unnecessary words, cut tangential discussions, and even re-record speech to make recordings concise and engaging. Prior work automatically summarized speech by removing full sentences (extraction), but rigid extraction limits expressivity. AI tools can summarize then re-synthesize speech (abstraction), but abstraction strips the speaker's style. We present TalkLess, a system that flexibly combines extraction and abstraction to condense speech while preserving its content and style. To edit speech, TalkLess first generates possible transcript edits, selects edits to maximize compression, coverage, and audio quality, then uses a speech editing model to translate transcript edits into audio edits. TalkLess's interface provides creators control over automated edits by separating low-level wording edits (via the compression pane) from major content edits (via the outline pane). TalkLess achieves higher coverage and removes more speech errors than a state-of-the-art extractive approach. A comparison study (N=12) showed that TalkLess significantly decreased cognitive load and editing effort in speech editing. We further demonstrate TalkLess's potential in an exploratory study (N=3) where creators edited their own speech.",
      "authors": [
        "Karim Benharrak",
        "Puyuan Peng",
        "Amy Pavel"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-21T03:00:00+00:00",
          "link": "https://arxiv.org/abs/2507.15202v1",
          "size": "10844kb",
          "version": "v1"
        }
      ],
      "title": "TalkLess: Blending Extractive and Abstractive Speech Summarization for Editing Speech to Preserve Content and Style",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.15202",
        "HTML": "https://arxiv.org/html/2507.15202",
        "PDF": "https://arxiv.org/pdf/2507.15202"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "partial",
        "reason": "The paper presents TalkLess, a speech editing system that blends extractive and abstractive summarization. Creativity is discussed as a secondary aspect, particularly in how speech content and style can be creatively preserved through editing."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14944",
      "abstract": "Deploying Large Language Models (LLMs) in high-stakes domains is impeded by a dual challenge: the need for deep, dynamic expert knowledge injection and nuanced value alignment. Prevailing paradigms often address these challenges separately, creating a persistent tension between knowledge and alignment; knowledge-focused methods like Retrieval-Augmented Generation (RAG) have limited deep alignment capabilities, while alignment-focused methods like Reinforcement Learning from Human Feedback (RLHF) struggle with the agile injection of expert wisdom. This paper introduces a new collaborative philosophy, Expert-owned AI behavior design, realized through Architectural Alignment-a paradigm that unifies these two goals within a single framework called the Layered Expert Knowledge Injection Architecture (LEKIA). LEKIA operates as an intelligent intermediary that guides an LLM's reasoning process without altering its weights, utilizing a three-tiered structure: a Theoretical Layer for core principles, a Practical Layer for exemplary cases, and an Evaluative Layer for real-time, value-aligned self-correction. We demonstrate the efficacy of this paradigm through the successful implementation of a LEKIA-based psychological support assistant for the special education field. Our work presents a path toward more responsible and expert-driven AI, empowering domain specialists to directly architect AI behavior and resolve the tension between knowledge and alignment.",
      "authors": [
        "Boning Zhao and Yutong Hu"
      ],
      "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-20T12:45:07+00:00",
          "link": "https://arxiv.org/abs/2507.14944v1",
          "size": "414kb",
          "version": "v1"
        }
      ],
      "title": "LEKIA: A Framework for Architectural Alignment via Expert Knowledge Injection",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14944",
        "HTML": "https://arxiv.org/html/2507.14944",
        "PDF": "https://arxiv.org/pdf/2507.14944"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The focus is on architectural alignment and expert knowledge injection into AI systems, without discussion of creativity or creative systems."
      },
      "source": "arXiv"
    },
    {
      "id": "2506.12540",
      "abstract": "Brain-computer interfaces offer significant therapeutic opportunities for a variety of neurophysiological and neuropsychiatric disorders and may perhaps one day lead to augmenting the cognition and decision-making of the healthy brain. However, existing regulatory frameworks designed for implantable medical devices are inadequate to address the unique ethical, legal, and social risks associated with next-generation networked brain-computer interfaces. In this article, we make nine recommendations to support developers in the design of BCIs and nine recommendations to support policymakers in the application of BCIs, drawing insights from the regulatory history of IMDs and principles from AI ethics. We begin by outlining the historical development of IMDs and the regulatory milestones that have shaped their oversight. Next, we summarize similarities between IMDs and emerging implantable BCIs, identifying existing provisions for their regulation. We then use two case studies of emerging cutting-edge BCIs, the HALO and SCALO computer systems, to highlight distinctive features in the design and application of next-generation BCIs arising from contemporary chip architectures, which necessitate reevaluating regulatory approaches. We identify critical ethical considerations for these BCIs, including unique conceptions of autonomy, identity, and mental privacy. Based on these insights, we suggest potential avenues for the ethical regulation of BCIs, emphasizing the importance of interdisciplinary collaboration and proactive mitigation of potential harms. The goal is to support the responsible design and application of new BCIs, ensuring their safe and ethical integration into medical practice.",
      "authors": [
        "Renee Sirbu",
        "Jessica Morley",
        "Tyler Schroder",
        "Raghavendra Pradyumna Pothukuchi",
        "Muhammed Ugur",
        "Abhishek Bhattacharjee",
        "Luciano Floridi"
      ],
      "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)",
        "Computers and Society (cs.CY)",
        "Emerging Technologies (cs.ET)"
      ],
      "submission_historys": [
        {
          "date": "2025-06-14T15:29:41+00:00",
          "link": "https://arxiv.org/abs/2506.12540v1",
          "size": "411kb",
          "version": "v1"
        },
        {
          "date": "2025-07-21T15:25:50+00:00",
          "link": "https://arxiv.org/abs/2506.12540v2",
          "size": "410kb",
          "version": "v2"
        }
      ],
      "title": "Regulating Next-Generation Implantable Brain-Computer Interfaces: Recommendations for Ethical Development and Implementation",
      "links": {
        "Abstract": "https://arxiv.org/abs/2506.12540",
        "PDF": "https://arxiv.org/pdf/2506.12540"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper is primarily concerned with the ethical development, regulation, and implementation of brain-computer interfaces, with no specific focus on creativity."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.15443",
      "abstract": "To understand and quantify the quality of mixed-presence collaboration around wall-sized displays, robust evaluation methodologies are needed, that are adapted for a room-sized experience and are not perceived as obtrusive. In this paper, we propose our approach for measuring joint attention based on head gaze data. We describe how it has been implemented for a user study on mixed presence collaboration with two wall-sized displays and report on the insights we gained so far from its implementation, with a preliminary focus on the data coming from one particular session.",
      "authors": [
        "Adrien Coppens",
        "Val\\'erie Maquil"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-21T09:53:24+00:00",
          "link": "https://arxiv.org/abs/2507.15443v1",
          "size": "1436kb",
          "version": "v1"
        }
      ],
      "title": "Evaluating Joint Attention for Mixed-Presence Collaboration on Wall-Sized Displays",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.15443",
        "HTML": "https://arxiv.org/html/2507.15443",
        "PDF": "https://arxiv.org/pdf/2507.15443"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The focus of this paper is evaluating joint attention during mixed-presence collaboration. It centers on understanding collaboration dynamics on large displays, but does not address creativity as a theme."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.15783",
      "abstract": "As Generative Artificial Intelligence (GenAI) driven chatbots like Character.AI become embedded in adolescent life, they raise concerns about emotional dependence and digital overreliance. While studies have investigated the overreliance of adults on these chatbots, they have not investigated teens' interactions with chatbots with customizable personas. We analyzed 318 Reddit posts made by users self-reported as 13-17 years old on the Character.AI subreddit to understand patterns of overreliance. We found teens commonly begin using chatbots for emotional support or creative expression, but many develop strong attachments that interfere with offline relationships and daily routines. Their posts revealed recurring signs of psychological distress, cycles of relapse, and difficulty disengaging. Teens reported that their overreliance often ended when they reflect on the harm, return to in-person social settings, or become frustrated by platform restrictions. Based on the implications of our findings, we provide recommendations for future chatbot design so they can promote self-awareness, support real-world engagement, and involve teens in developing safer digital tools.",
      "authors": [
        "Mohammad 'Matt' Namvarpour",
        "Brandon Brofsky",
        "Jessica Medina",
        "Mamtaj Akter",
        "and Afsaneh Razi"
      ],
      "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)",
        "Artificial Intelligence (cs.AI)",
        "Computers and Society (cs.CY)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-21T16:39:33+00:00",
          "link": "https://arxiv.org/abs/2507.15783v1",
          "size": "109kb",
          "version": "v1"
        }
      ],
      "title": "Romance, Relief, and Regret: Teen Narratives of Chatbot Overreliance",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.15783",
        "HTML": "https://arxiv.org/html/2507.15783",
        "PDF": "https://arxiv.org/pdf/2507.15783"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "core",
        "reason": "The paper investigates teenagers' use of chatbots for creative expression and emotional support. It highlights chatbot overreliance affecting creativity and offline relationships, making creativity a primary focus in understanding the impact of chatbots on young users."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14418",
      "abstract": "One challenge in technical interviews is the think-aloud process, where candidates verbalize their thought processes while solving coding tasks. Despite its importance, opportunities for structured practice remain limited. Conversational AI offers potential assistance, but limited research explores user perceptions of its role in think-aloud practice. To address this gap, we conducted a study with 17 participants using an LLM-based technical interview practice tool. Participants valued AI's role in simulation, feedback, and learning from generated examples. Key design recommendations include promoting social presence in conversational AI for technical interview simulation, providing feedback beyond verbal content analysis, and enabling crowdsourced think-aloud examples through human-AI collaboration. Beyond feature design, we examined broader considerations, including intersectional challenges and potential strategies to address them, how AI-driven interview preparation could promote equitable learning in computing careers, and the need to rethink AI's role in interview practice by suggesting a research direction that integrates human-AI collaboration.",
      "authors": [
        "Taufiq Daryanto",
        "Sophia Stil",
        "Xiaohan Ding",
        "Daniel Manesh",
        "Sang Won Lee",
        "Tim Lee",
        "Stephanie Lunn",
        "Sarah Rodriguez",
        "Chris Brown and Eugenia Rho"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)",
        "Artificial Intelligence (cs.AI)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-19T00:15:05+00:00",
          "link": "https://arxiv.org/abs/2507.14418v1",
          "size": "4207kb",
          "version": "v1"
        }
      ],
      "title": "Designing Conversational AI to Support Think-Aloud Practice in Technical Interview Preparation for CS Students",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14418",
        "HTML": "https://arxiv.org/html/2507.14418",
        "PDF": "https://arxiv.org/pdf/2507.14418"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "partial",
        "reason": "The paper includes aspects of creativity in designing Conversational AI for technical interview preparation, by exploring user perceptions and suggesting human-AI collaboration, which supports creative thought processes in coding tasks."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.15197",
      "abstract": "In requirements engineering (RE), personas are now being used to represent user expectations and needs. This systematic mapping study (SMS) aims to explore the most recent studies and to cover recent changes in trends, especially related to the recent evolution of Generative AI approaches. Our SMS covers the period between April 2023 and April 2025. We identified 22 relevant publications and analysed persona representation, construction, validation, as well as RE activities covered by personas. We identified that a number of studies applied AI-based solutions for persona construction and validation. We observed that template-based personas are becoming more popular nowadays. We also observed an increase in the proportion of studies covering validation aspects.",
      "authors": [
        "Chowdhury Shahriar Muzammel",
        "Maria Spichkova",
        "James Harland"
      ],
      "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
      "subjects": [
        "Software Engineering (cs.SE)",
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-21T02:52:30+00:00",
          "link": "https://arxiv.org/abs/2507.15197v1",
          "size": "89kb",
          "version": "v1"
        }
      ],
      "title": "Towards Using Personas in Requirements Engineering: What Has Been Changed Recently?",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.15197",
        "HTML": "https://arxiv.org/html/2507.15197",
        "PDF": "https://arxiv.org/pdf/2507.15197"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "This paper is focused on the use of personas in requirements engineering. It does not address creativity explicitly or as a major theme. The focus is on representation and validation of user personas in RE."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14846",
      "abstract": "The rapid evolution of lightweight consumer augmented reality (AR) smart glasses (a.k.a. optical see-through head-mounted displays) offers novel opportunities for learning, particularly through their unique capability to deliver multimodal information in just-in-time, micro-learning scenarios. This research investigates how such devices can support mobile second-language acquisition by presenting progressive sentence structures in multimodal formats. In contrast to the commonly used vocabulary (i.e., word) learning approach for novice learners, we present a \"progressive presentation\" method that combines both word and sentence learning by sequentially displaying sentence components (subject, verb, object) while retaining prior context. Pilot and formal studies revealed that progressive presentation enhances recall, particularly in mobile scenarios such as walking. Additionally, incorporating timed gaps between word presentations further improved learning effectiveness under multitasking conditions. Our findings demonstrate the utility of progressive presentation and provide usage guidelines for educational applications-even during brief, on-the-go learning moments.",
      "authors": [
        "Nuwan Janaka",
        "Shengdong Zhao",
        "Ashwin Ram",
        "Ruoxin Sun",
        "Sherisse Tan Jing Wen",
        "Danae Li",
        "David Hsu"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)",
        "Computers and Society (cs.CY)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-20T07:25:45+00:00",
          "link": "https://arxiv.org/abs/2507.14846v1",
          "size": "1195kb",
          "version": "v1"
        }
      ],
      "title": "Progressive Sentences: Combining the Benefits of Word and Sentence Learning",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14846",
        "HTML": "https://arxiv.org/html/2507.14846",
        "PDF": "https://arxiv.org/pdf/2507.14846"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "partial",
        "reason": "The paper discusses a novel method for learning that involves using AR technology. It touches on creativity by exploring innovative learning techniques, though it is not the core focus."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.15433",
      "abstract": "Wall-Sized Displays have spatial characteristics that are difficult to address during user interface design. The design at scale 1:1 could be part of the solution. In this paper, we present the results of two user studies and one technology review, exploring the usability of popular, desktop-optimized prototyping tools, for designing at scale on Wall-Sized Displays. We considered two wall-sized display setups, and three different interaction methods: touch, a keyboard equipped with a touchpad, and a tablet. We observed that designing at scale 1:1 was appreciated. Tablet-based interaction proved to be the most comfortable interaction method, and a mix of interaction modalities is promising. In addition, care must be given to the surrounding environment, such as furniture. We propose twelve design guidelines for a design tool dedicated to this specific context. Overall, existing user interface design tools do not yet fully support design on and for wall-sized displays and require further considerations in terms of placement of user interface elements and the provision of additional features.",
      "authors": [
        "Lou Schwartz",
        "Mohammad Ghoniem",
        "Val\\'erie Maquil",
        "Adrien Coppens",
        "Johannes Hermen"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-21T09:44:34+00:00",
          "link": "https://arxiv.org/abs/2507.15433v1",
          "size": "32752kb",
          "version": "v1"
        }
      ],
      "title": "Designing at 1:1 Scale on Wall-Sized Displays Using Existing UI Design Tools",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.15433",
        "HTML": "https://arxiv.org/html/2507.15433",
        "PDF": "https://arxiv.org/pdf/2507.15433"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "partial",
        "reason": "This paper involves designing user interfaces on Wall-Sized Displays, which can enhance user creativity by providing different design perspectives. However, the primary focus is on usability and interaction rather than creativity. Creativity appears as a supporting theme, especially in providing design guidelines."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.15729",
      "abstract": "The rapid development of Large Language Models (LLMs) creates an exciting potential for flexible, general knowledge-driven Human-Robot Interaction (HRI) systems for assistive robots. Existing HRI systems demonstrate great progress in interpreting and following user instructions, action generation, and robot task solving. On the other hand, bi-directional, multi-modal, and context-aware support of the user in collaborative tasks still remains an open challenge. In this paper, we present a gaze- and speech-informed interface to the assistive robot, which is able to perceive the working environment from multiple vision inputs and support the dynamic user in their tasks. Our system is designed to be modular and transferable to adapt to diverse tasks and robots, and it is capable of real-time use of language-based interaction state representation and fast on board perception modules. Its development was supported by multiple public dissemination events, contributing important considerations for improved robustness and user experience. Furthermore, in two lab studies, we compare the performance and user ratings of our system with those of a traditional scripted HRI pipeline. Our findings indicate that an LLM-based approach enhances adaptability and marginally improves user engagement and task execution metrics but may produce redundant output, while a scripted pipeline is well suited for more straightforward tasks.",
      "authors": [
        "Jens V. R\\\"uppel",
        "Andrey Rudenko",
        "Tim Schreiter",
        "Martin Magnusson",
        "Achim J. Lilienthal"
      ],
      "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
      "subjects": [
        "Robotics (cs.RO)",
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-21T15:38:25+00:00",
          "link": "https://arxiv.org/abs/2507.15729v1",
          "size": "9758kb",
          "version": "v1"
        }
      ],
      "title": "Gaze-supported Large Language Model Framework for Bi-directional Human-Robot Interaction",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.15729",
        "HTML": "https://arxiv.org/html/2507.15729",
        "PDF": "https://arxiv.org/pdf/2507.15729"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "partial",
        "reason": "The paper focuses on bi-directional human-robot interaction and the development of a gaze-supported framework using Large Language Models. While creativity is not the core focus, the system's adaptability and support for dynamic user tasks may facilitate creative processes, making creativity a secondary theme."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14769",
      "abstract": "Modern web interfaces are unnecessarily complex to use as they overwhelm users with excessive text and visuals unrelated to their current goals. This problem particularly impacts screen reader users (SRUs), who navigate content sequentially and may spend minutes traversing irrelevant elements before reaching desired information compared to vision users (VUs) who visually skim in seconds. We present Task Mode, a system that dynamically filters web content based on user-specified goals using large language models to identify and prioritize relevant elements while minimizing distractions. Our approach preserves page structure while offering multiple viewing modes tailored to different access needs. Our user study with 12 participants (6 VUs, 6 SRUs) demonstrates that our approach reduced task completion time for SRUs while maintaining performance for VUs, decreasing the completion time gap between groups from 2x to 1.2x. 11 of 12 participants wanted to use Task Mode in the future, reporting that Task Mode supported completing tasks with less effort and fewer distractions. This work demonstrates how designing new interactions simultaneously for visual and non-visual access can reduce rather than reinforce accessibility disparities in future technology created by human-computer interaction researchers and practitioners.",
      "authors": [
        "Ananya Gubbi Mohanbabu",
        "Yotam Sechayk",
        "Amy Pavel"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-19T23:41:08+00:00",
          "link": "https://arxiv.org/abs/2507.14769v1",
          "size": "6032kb",
          "version": "v1"
        }
      ],
      "title": "Task Mode: Dynamic Filtering for Task-Specific Web Navigation using LLMs",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14769",
        "HTML": "https://arxiv.org/html/2507.14769",
        "PDF": "https://arxiv.org/pdf/2507.14769"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "This paper addresses web navigation and accessibility using LLMs, focusing on reducing interface complexity rather than creativity."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14451",
      "abstract": "Reliability on cloud providers for ASR inference to support child-centered voice-based applications is becoming challenging due to regulatory and privacy challenges. Motivated by a privacy-preserving design, this study aims to develop a lightweight & efficient Whisper ASR system capable of running on a Raspberry Pi. Upon evaluation of the MyST corpus and by examining various filtering strategies to fine-tune the `tiny.en' model, a Word Error Rate (WER) of 15.9% was achieved (11.8% filtered). A low-rank compression reduces the encoder size by 0.51M with 1.26x faster inference in GPU, with 11% relative WER increase. During inference on Pi, the compressed version required ~2 GFLOPS fewer computations. The RTF for both the models ranged between [0.23-0.41] for various input audio durations. Analyzing the RAM usage and CPU temperature showed that the PI was capable of handling both the tiny models, however it was noticed that small models initiated additional overhead/thermal throttling.",
      "authors": [
        "Satwik Dutta",
        "Shruthigna Chandupatla",
        "John Hansen"
      ],
      "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
      "subjects": [
        "Audio and Speech Processing (eess.AS)",
        "Human-Computer Interaction (cs.HC)",
        "Sound (cs.SD)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-19T02:55:48+00:00",
          "link": "https://arxiv.org/abs/2507.14451v1",
          "size": "674kb",
          "version": "v1"
        }
      ],
      "title": "Adapting Whisper for Lightweight and Efficient Automatic Speech Recognition of Children for On-device Edge Applications",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14451",
        "HTML": "https://arxiv.org/html/2507.14451",
        "PDF": "https://arxiv.org/pdf/2507.14451"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The study aims to adapt Whisper for efficient ASR in children’s applications, focusing on privacy and performance, with no engagement with creativity-related themes."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14961",
      "abstract": "AI solutionism is accelerated and substantiated by hype and HCI's elevation of novelty. Banning or abandoning technology is unlikely to work and probably not beneficial on the whole either -- but slow(er), deliberate use together with conscientious, critical engagement and non-engagement may help us navigate a post-AI hype world while contributing to a solid knowledge foundation and reducing harmful impacts in education and research.",
      "authors": [
        "Katja Rogers"
      ],
      "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-20T13:46:12+00:00",
          "link": "https://arxiv.org/abs/2507.14961v1",
          "size": "104kb",
          "version": "v1"
        }
      ],
      "title": "Emphasizing Deliberation and Critical Thinking in an AI Hype World",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14961",
        "HTML": "https://arxiv.org/html/2507.14961",
        "PDF": "https://arxiv.org/pdf/2507.14961"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "partial",
        "reason": "The paper discusses the use of AI in education and research with an emphasis on critical thinking and deliberation. Creativity is a secondary theme in terms of contributing to knowledge foundations and reducing harmful impacts."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.15650",
      "abstract": "Computer aided formative assessment can be used to enhance a learning process, for instance by providing feedback. There are many design choices for delivering feedback, that lead to a feedback strategy. In an informative feedback strategy, students do not immediately receive information about the correct response, but are offered the opportunity to retry a task to apply feedback information. In this small-scale qualitative study, we explore an informative feedback strategy designed to offer a balance between room for exploration and mitigation of learning barriers. The research questions concern the ways in which students interact with the feedback strategy and their appreciation of error-specific feedback as opposed to worked-out solutions. To answer these questions, twenty-five 15-to-17-year-old senior general secondary education students worked for approximately 20 minutes on linear and exponential extrapolation tasks in an online environment. Data included screen captures of students working with the environment and post-intervention interviews. Results showed that room for exploration offered opportunities for self-guidance while mitigation of learning barriers prevented disengagement. Furthermore, students appreciated balanced feedback. We conclude that the balanced feedback strategy yielded fruitful student-environment interactions.",
      "authors": [
        "Gerben van der Hoek",
        "Bastiaan Heeren",
        "Rogier Bos",
        "Paul Drijvers",
        "and Johan Jeuring"
      ],
      "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-21T14:14:56+00:00",
          "link": "https://arxiv.org/abs/2507.15650v1",
          "size": "965kb",
          "version": "v1"
        }
      ],
      "title": "Chapter 11 Students' interaction with and appreciation of automated informative tutoring feedback",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.15650",
        "PDF": "https://arxiv.org/pdf/2507.15650"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "partial",
        "reason": "Creativity is a secondary theme in exploring how students interact with feedback by providing room for exploration within the learning process, which can foster creative problem solving."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14384",
      "abstract": "In this study, we investigate the use of large language models (LLMs), specifically ChatGPT, for structured deductive qualitative coding. While most current research emphasizes inductive coding applications, we address the underexplored potential of LLMs to perform deductive classification tasks aligned with established human-coded schemes. Using the Comparative Agendas Project (CAP) Master Codebook, we classified U.S. Supreme Court case summaries into 21 major policy domains. We tested four intervention methods: zero-shot, few-shot, definition-based, and a novel Step-by-Step Task Decomposition strategy, across repeated samples. Performance was evaluated using standard classification metrics (accuracy, F1-score, Cohen's kappa, Krippendorff's alpha), and construct validity was assessed using chi-squared tests and Cramer's V. Chi-squared and effect size analyses confirmed that intervention strategies significantly influenced classification behavior, with Cramer's V values ranging from 0.359 to 0.613, indicating moderate to strong shifts in classification patterns. The Step-by-Step Task Decomposition strategy achieved the strongest reliability (accuracy = 0.775, kappa = 0.744, alpha = 0.746), achieving thresholds for substantial agreement. Despite the semantic ambiguity within case summaries, ChatGPT displayed stable agreement across samples, including high F1 scores in low-support subclasses. These findings demonstrate that with targeted, custom-tailored interventions, LLMs can achieve reliability levels suitable for integration into rigorous qualitative coding workflows.",
      "authors": [
        "Angjelin Hila and Elliott Hauser"
      ],
      "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)",
        "Computation and Language (cs.CL)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-18T22:16:04+00:00",
          "link": "https://arxiv.org/abs/2507.14384v1",
          "size": "2574kb",
          "version": "v1"
        }
      ],
      "title": "Assessing the Reliability of Large Language Models for Deductive Qualitative Coding: A Comparative Study of ChatGPT Interventions",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14384",
        "HTML": "https://arxiv.org/html/2507.14384",
        "PDF": "https://arxiv.org/pdf/2507.14384"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "This paper investigates the use of language models for deductive qualitative coding, emphasizing reliability in classification tasks, without connecting to creativity."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14623",
      "abstract": "This study examines cross-cultural interactions between Chinese users and self-identified \"TikTok Refugees\"(foreign users who migrated to RedNote after TikTok's U.S. ban). Based on a dataset of 1,862 posts and 403,054 comments, we use large language model-based sentiment classification and BERT-based topic modelling to explore how both groups engage with the TikTok refugee phenomenon. We analyse what themes foreign users express, how Chinese users respond, how stances (Pro-China, Neutral, Pro-Foreign) shape emotional expression, and how affective responses differ across topics and identities. Results show strong affective asymmetry: Chinese users respond with varying emotional intensities across topics and stances: pride and praise dominate cultural threads, while political discussions elicit high levels of contempt and anger, especially from Pro-China commenters. Pro-Foreign users exhibit the strongest negative emotions across all topics, whereas neutral users express curiosity and joy but still reinforce mainstream discursive norms. Cross-topic comparisons reveal that appearance-related content produces the most emotionally balanced interactions, while politics generates the highest polarization. Our findings reveal distinct emotion-stance structures in Sino-foreign online interactions and offer empirical insights into identity negotiation in transnational digital publics.",
      "authors": [
        "Mingchen Li",
        "Wenbo Xu",
        "Wenqing Gu",
        "Yixuan Xie",
        "Yao Zhou",
        "Yunsong Dai",
        "Cheng Tan",
        "Pan Hui"
      ],
      "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
      "subjects": [
        "Social and Information Networks (cs.SI)",
        "Computers and Society (cs.CY)",
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-19T13:38:33+00:00",
          "link": "https://arxiv.org/abs/2507.14623v1",
          "size": "2709kb",
          "version": "v1"
        }
      ],
      "title": "Rejection or Inclusion in the Emotion-Identity Dynamics of TikTok Refugees on RedNote",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14623",
        "HTML": "https://arxiv.org/html/2507.14623",
        "PDF": "https://arxiv.org/pdf/2507.14623"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The study primarily focuses on cross-cultural interactions and emotional dynamics on social platforms. Creativity is not mentioned or implied as a theme in the research."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.15846",
      "abstract": "Graphical User Interface (GUI) grounding maps natural language instructions to precise interface locations for autonomous interaction. Current reinforcement learning approaches use binary rewards that treat elements as hit-or-miss targets, creating sparse signals that ignore the continuous nature of spatial interactions. Motivated by human clicking behavior that naturally forms Gaussian distributions centered on target elements, we introduce GUI Gaussian Grounding Rewards (GUI-G$^2$), a principled reward framework that models GUI elements as continuous Gaussian distributions across the interface plane. GUI-G$^2$ incorporates two synergistic mechanisms: Gaussian point rewards model precise localization through exponentially decaying distributions centered on element centroids, while coverage rewards assess spatial alignment by measuring the overlap between predicted Gaussian distributions and target regions. To handle diverse element scales, we develop an adaptive variance mechanism that calibrates reward distributions based on element dimensions. This framework transforms GUI grounding from sparse binary classification to dense continuous optimization, where Gaussian distributions generate rich gradient signals that guide models toward optimal interaction positions. Extensive experiments across ScreenSpot, ScreenSpot-v2, and ScreenSpot-Pro benchmarks demonstrate that GUI-G$^2$, substantially outperforms state-of-the-art method UI-TARS-72B, with the most significant improvement of 24.7% on ScreenSpot-Pro. Our analysis reveals that continuous modeling provides superior robustness to interface variations and enhanced generalization to unseen layouts, establishing a new paradigm for spatial reasoning in GUI interaction tasks.",
      "authors": [
        "Fei Tang",
        "Zhangxuan Gu",
        "Zhengxi Lu",
        "Xuyang Liu",
        "Shuheng Shen",
        "Changhua Meng",
        "Wen Wang",
        "Wenqi Zhang",
        "Yongliang Shen",
        "Weiming Lu",
        "Jun Xiao",
        "Yueting Zhuang"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Machine Learning (cs.LG)",
        "Artificial Intelligence (cs.AI)",
        "Computation and Language (cs.CL)",
        "Computer Vision and Pattern Recognition (cs.CV)",
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-21T17:53:42+00:00",
          "link": "https://arxiv.org/abs/2507.15846v1",
          "size": "2762kb",
          "version": "v1"
        }
      ],
      "title": "GUI-G$^2$: Gaussian Reward Modeling for GUI Grounding",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.15846",
        "HTML": "https://arxiv.org/html/2507.15846",
        "PDF": "https://arxiv.org/pdf/2507.15846"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper is about improving GUI grounding using Gaussian reward modeling, primarily focusing on spatial reasoning, interaction tasks, and reinforcement learning methods. It does not address creativity or its related concepts."
      },
      "source": "arXiv"
    },
    {
      "id": "2505.17593",
      "abstract": "Generative AI offers potential for educational support, but often lacks pedagogical grounding and awareness of the student's learning context. Furthermore, researching student interactions with these tools within authentic learning environments remains challenging. To address this, we present JELAI, an open-source platform architecture designed to integrate fine-grained Learning Analytics (LA) with Large Language Model (LLM)-based tutoring directly within a Jupyter Notebook environment. JELAI employs a modular, containerized design featuring JupyterLab extensions for telemetry and chat, alongside a central middleware handling LA processing and context-aware LLM prompt enrichment. This architecture enables the capture of integrated code interaction and chat data, facilitating real-time, context-sensitive AI scaffolding and research into student behaviour. We describe the system's design, implementation, and demonstrate its feasibility through system performance benchmarks and two proof-of-concept use cases illustrating its capabilities for logging multi-modal data, analysing help-seeking patterns, and supporting A/B testing of AI configurations. JELAI's primary contribution is its technical framework, providing a flexible tool for researchers and educators to develop, deploy, and study LA-informed AI tutoring within the widely used Jupyter ecosystem.",
      "authors": [
        "Manuel Valle Torre",
        "Thom van der Velden",
        "Marcus Specht",
        "Catharine Oertel"
      ],
      "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)",
        "Artificial Intelligence (cs.AI)"
      ],
      "submission_historys": [
        {
          "date": "2025-05-23T07:58:53+00:00",
          "link": "https://arxiv.org/abs/2505.17593v1",
          "size": "885kb",
          "version": "v1"
        }
      ],
      "title": "JELAI: Integrating AI and Learning Analytics in Jupyter Notebooks",
      "links": {
        "Abstract": "https://arxiv.org/abs/2505.17593",
        "HTML": "https://arxiv.org/html/2505.17593",
        "PDF": "https://arxiv.org/pdf/2505.17593"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "partial",
        "reason": "While the primary focus of the paper is on educational support with AI and Learning Analytics within Jupyter Notebooks, it involves creative AI tutoring and explores how these tools can be used in inventive educational contexts, implying some creative aspects."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14482",
      "abstract": "In-depth analysis of competitive debates is essential for participants to develop argumentative skills and refine strategies, and further improve their debating performance. However, manual analysis of unstructured and unlabeled textual records of debating is time-consuming and ineffective, as it is challenging to reconstruct contextual semantics and track logical connections from raw data. To address this, we propose Conch, an interactive visualization system that systematically analyzes both what is debated and how it is debated. In particular, we propose a novel parallel spiral visualization that compactly traces the multidimensional evolution of clash points and participant interactions throughout debate process. In addition, we leverage large language models with well-designed prompts to automatically identify critical debate elements such as clash points, disagreements, viewpoints, and strategies, enabling participants to understand the debate context comprehensively. Finally, through two case studies on real-world debates and a carefully-designed user study, we demonstrate Conch's effectiveness and usability for competitive debate analysis.",
      "authors": [
        "Qianhe Chen",
        "Yong Wang",
        "Yixin Yu",
        "Xiyuan Zhu",
        "Xuerou Yu",
        "Ran Wang"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-19T04:42:09+00:00",
          "link": "https://arxiv.org/abs/2507.14482v1",
          "size": "5271kb",
          "version": "v1"
        }
      ],
      "title": "Conch: Competitive Debate Analysis via Visualizing Clash Points and Hierarchical Strategies",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14482",
        "HTML": "https://arxiv.org/html/2507.14482",
        "PDF": "https://arxiv.org/pdf/2507.14482"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper focuses on competitive debate analysis and visualization, without any direct relevance or mention of creativity as a research theme."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14698",
      "abstract": "EEG-based emotion recognition plays an important role in developing adaptive brain-computer communication systems, yet faces two fundamental challenges in practical implementations: (1) effective integration of non-stationary spatial-temporal neural patterns, (2) robust adaptation to dynamic emotional intensity variations in real-world scenarios. This paper proposes SST-CL, a novel framework integrating spatial-temporal transformers with curriculum learning. Our method introduces two core components: a spatial encoder that models inter-channel relationships and a temporal encoder that captures multi-scale dependencies through windowed attention mechanisms, enabling simultaneous extraction of spatial correlations and temporal dynamics from EEG signals. Complementing this architecture, an intensity-aware curriculum learning strategy progressively guides training from high-intensity to low-intensity emotional states through dynamic sample scheduling based on a dual difficulty assessment. Comprehensive experiments on three benchmark datasets demonstrate state-of-the-art performance across various emotional intensity levels, with ablation studies confirming the necessity of both architectural components and the curriculum learning mechanism.",
      "authors": [
        "Xuetao Lin (1 and 2)",
        "Tianhao Peng (1 and 2)",
        "Peihong Dai (1 and 2)",
        "Yu Liang (3)",
        "Wenjun Wu (1 and 2) ((1) Beihang University",
        "Beijing",
        "China",
        "(2) SKLCCSE",
        "Beijing",
        "China",
        "(3) Beijing University of Technology",
        "Beijing",
        "China)"
      ],
      "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
      "subjects": [
        "Machine Learning (cs.LG)",
        "Artificial Intelligence (cs.AI)",
        "Human-Computer Interaction (cs.HC)",
        "Signal Processing (eess.SP)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-19T17:23:38+00:00",
          "link": "https://arxiv.org/abs/2507.14698v1",
          "size": "1961kb",
          "version": "v1"
        }
      ],
      "title": "Spatial-Temporal Transformer with Curriculum Learning for EEG-Based Emotion Recognition",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14698",
        "HTML": "https://arxiv.org/html/2507.14698",
        "PDF": "https://arxiv.org/pdf/2507.14698"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "This research concerns EEG-based emotion recognition and does not involve creativity as a research theme or objective."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14527",
      "abstract": "Researchers frequently need to synthesize their own publications into coherent narratives that demonstrate their scholarly contributions. To suit diverse communication contexts, exploring alternative ways to organize one's work while maintaining coherence is particularly challenging, especially in interdisciplinary fields like HCI where individual researchers' publications may span diverse domains and methodologies. In this paper, we present PaperBridge, a human-AI co-exploration system informed by a formative study and content analysis. PaperBridge assists researchers in exploring diverse perspectives for organizing their publications into coherent narratives. At its core is a bi-directional analysis engine powered by large language models, supporting iterative exploration through both top-down user intent (e.g., determining organization structure) and bottom-up refinement on narrative components (e.g., thematic paper groupings). Our user study (N=12) demonstrated PaperBridge's usability and effectiveness in facilitating the exploration of alternative research narratives. Our findings also provided empirical insights into how interactive systems can scaffold academic communication tasks.",
      "authors": [
        "Runhua Zhang",
        "Yang Ouyang",
        "Leixian Shen",
        "Yuying Tang",
        "Xiaojuan Ma",
        "Huamin Qu",
        "Xian Xu"
      ],
      "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-19T08:04:23+00:00",
          "link": "https://arxiv.org/abs/2507.14527v1",
          "size": "3315kb",
          "version": "v1"
        }
      ],
      "title": "PaperBridge: Crafting Research Narratives through Human-AI Co-Exploration",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14527",
        "HTML": "https://arxiv.org/html/2507.14527",
        "PDF": "https://arxiv.org/pdf/2507.14527"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "partial",
        "reason": "The paper discusses human-AI co-exploration for crafting research narratives. Creativity is involved as a secondary theme in organizing and exploring alternative research presentations."
      },
      "source": "arXiv"
    },
    {
      "id": "2404.16660",
      "abstract": "Mobile device control agents can largely enhance user interactions and productivity by automating daily tasks. However, despite growing interest in developing practical agents, the absence of a commonly adopted benchmark in this area makes it challenging to quantify scientific progress. In this work, we introduce B-MoCA: a novel benchmark with interactive environments for evaluating and developing mobile device control agents. To create a realistic benchmark, we develop B-MoCA based on the Android operating system and define 131 common daily tasks. Importantly, we incorporate a randomization feature that changes the configurations of mobile devices, including user interface layouts and language settings, to assess generalization performance. We benchmark diverse agents, including agents employing large language models (LLMs) or multi-modal LLMs as well as agents trained with imitation learning using human expert demonstrations. While these agents demonstrate proficiency in executing straightforward tasks, their poor performance on complex tasks highlights significant opportunities for future research to improve effectiveness. Our source code is publicly available at https://b-moca.github.io.",
      "authors": [
        "Juyong Lee",
        "Taywon Min",
        "Minyong An",
        "Dongyoon Hahm",
        "Haeone Lee",
        "Changyeon Kim",
        "Kimin Lee"
      ],
      "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)",
        "Artificial Intelligence (cs.AI)",
        "Machine Learning (cs.LG)"
      ],
      "submission_historys": [
        {
          "date": "2024-04-25T14:56:32+00:00",
          "link": "https://arxiv.org/abs/2404.16660v1",
          "size": "7387kb",
          "version": "v1"
        },
        {
          "date": "2024-10-19T07:07:58+00:00",
          "link": "https://arxiv.org/abs/2404.16660v2",
          "size": "10570kb",
          "version": "v2"
        },
        {
          "date": "2025-07-21T02:55:09+00:00",
          "link": "https://arxiv.org/abs/2404.16660v3",
          "size": "12223kb",
          "version": "v3"
        }
      ],
      "title": "Benchmarking Mobile Device Control Agents across Diverse Configurations",
      "links": {
        "Abstract": "https://arxiv.org/abs/2404.16660",
        "PDF": "https://arxiv.org/pdf/2404.16660"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper focuses on benchmarking mobile control agents and does not address or relate to creativity as a research theme."
      },
      "tasks": [
        "Benchmarking",
        "Imitation Learning"
      ],
      "source": "arXiv"
    },
    {
      "id": "2507.14543",
      "abstract": "It has always been a rather tough task to communicate with someone possessing a hearing impairment. One of the most tested ways to establish such a communication is through the use of sign based languages. However, not many people are aware of the smaller intricacies involved with sign language. Sign language recognition using computer vision aims at eliminating the communication barrier between deaf-mute and ordinary people so that they can properly communicate with others. Recently the pandemic has left the whole world shaken up and has transformed the way we communicate. Video meetings have become essential for everyone, even people with a hearing disability. In recent studies, it has been found that people with hearing disabilities prefer to sign over typing during these video calls. In this paper, we are proposing a browser extension that will automatically translate sign language to subtitles for everyone else in the video call. The Large-scale dataset which contains more than 2000 Word-Level ASL videos, which were performed by over 100 signers will be used.",
      "authors": [
        "Sharanya Mukherjee",
        "Md Hishaam Akhtar",
        "Kannadasan R"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Computer Vision and Pattern Recognition (cs.CV)",
        "Computers and Society (cs.CY)",
        "Human-Computer Interaction (cs.HC)",
        "Machine Learning (cs.LG)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-19T09:01:59+00:00",
          "link": "https://arxiv.org/abs/2507.14543v1",
          "size": "183kb",
          "version": "v1"
        }
      ],
      "title": "Real Time Captioning of Sign Language Gestures in Video Meetings",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14543",
        "HTML": "https://arxiv.org/html/2507.14543",
        "PDF": "https://arxiv.org/pdf/2507.14543"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper discusses real-time captioning of sign language gestures and improvements in communication for individuals with hearing impairments, without addressing creativity."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14316",
      "abstract": "In high-stakes, time-critical scenarios-such as emergency evacuation, first responder prioritization, and crisis management -- decision-makers must rapidly choose among spatial targets, such as exits, individuals to assist, or areas to secure. Advances in indoor sensing and artificial intelligence (AI) can support these decisions by visualizing real-time situational data and AI suggestions on 2D maps. However, mentally mapping this information onto real-world spaces imposes significant cognitive load. This load can impair users' ability to appropriately judge AI suggestions, leading to inappropriate reliance (e.g., accepting wrong AI suggestions or rejecting correct ones). Embedded visualizations in Augmented Reality (AR), by directly overlaying information onto physical environments, may reduce this load and foster more deliberate, appropriate reliance on AI. But is this true? In this work, we conducted an empirical study (N = 32) comparing AR see-through (embedded visualization) and 2D Minimap in time-critical, AI-assisted spatial target selection tasks. Contrary to our expectations, users exhibited greater inappropriate reliance on AI in the AR condition. Our analysis further reveals that this is primarily due to over-reliance, with factors specific to embedded visualizations, such as perceptual challenges, visual proximity illusions, and highly realistic visual representations. Nonetheless, embedded visualizations demonstrated notable benefits in spatial reasoning, such as spatial mapping and egocentric spatial imagery. We conclude by discussing the empirical insights, deriving design implications, and outlining important directions for future research on human-AI decision collaboration in AR.",
      "authors": [
        "Xianhao Carton Liu",
        "Difan Jia",
        "Tongyu Nie",
        "Evan Suma Rosenberg",
        "Victoria Interrante",
        "Chen Zhu-Tian"
      ],
      "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-18T18:40:06+00:00",
          "link": "https://arxiv.org/abs/2507.14316v1",
          "size": "7473kb",
          "version": "v1"
        }
      ],
      "title": "Can AR-Embedded Visualizations Foster Appropriate Reliance on AI in Spatial Decision Making? A Comparative Study of AR See-Through vs. 2D Minimap",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14316",
        "HTML": "https://arxiv.org/html/2507.14316",
        "PDF": "https://arxiv.org/pdf/2507.14316"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The focus here is on reliance on AI in decision-making using AR visualizations, without a direct link to creativity or creative tasks."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14859",
      "abstract": "The digital twin of humans is a relatively new concept. While many diverse definitions, architectures, and applications exist, a clear picture is missing on what, in fact, makes a human digital twin. Within this context, researchers and industrial use-case owners alike are unaware about the market potential of the - at the moment - rather theoretical construct. In this work, we draw a holistic vision of the human digital twin, and derive the specification of this holistic human digital twin in form of requirements, stakeholders, and users. For each group of users, we define exemplary applications that fall into the six levels of functionality: store, analyze, personalize, predict, control, and optimize. The functionality levels facilitate an abstraction of abilities of the human digital twin. From the manifold applications, we discuss three in detail to showcase the feasibility of the abstraction levels and the analysis of stakeholders and users. Based on the deep discussion, we derive a comprehensive list of requirements on the holistic human digital twin. These considerations shall be used as a guideline for research and industries for the implementation of human digital twins, particularly in context of reusability in multiple target applications.",
      "authors": [
        "Nils Mandischer",
        "Alexander Atanasyan",
        "Ulrich Dahmen",
        "Michael Schluse",
        "J\\\"urgen Rossmann",
        "Lars Mikelsons"
      ],
      "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)",
        "Systems and Control (cs.SY)",
        "Systems and Control (eess.SY)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-20T07:59:54+00:00",
          "link": "https://arxiv.org/abs/2507.14859v1",
          "size": "6448kb",
          "version": "v1"
        }
      ],
      "title": "Holistic Specification of the Human Digital Twin: Stakeholders, Users, Functionalities, and Applications",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14859",
        "HTML": "https://arxiv.org/html/2507.14859",
        "PDF": "https://arxiv.org/pdf/2507.14859"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper focuses on the concept of the human digital twin and its applications, stakeholders, and functionalities but does not address creativity as a research theme."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.15188",
      "abstract": "Requirements Engineering (RE) is one of the most interaction-intensive phases of software development. This means that RE activities might be especially impacted by stakeholders' national culture. Software development projects increasingly have a very diverse range of stakeholders. To future-proof RE activities, we need to help RE practitioners avoid misunderstandings and conflicts that might arise from not understanding potential Cultural Influences (CIs). Moreover, an awareness of CIs supports diversity and inclusion in the IT profession. Bangladesh has a growing IT sector with some unique socio-cultural characteristics, and has been largely overlooked in this research field. In this study, we aim to investigate how the RE process is adopted in the context of Bangladeshi culture and what cultural influences impact overall RE activities.",
      "authors": [
        "Chowdhury Shahriar Muzammel",
        "Maria Spichkova",
        "James Harland"
      ],
      "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
      "subjects": [
        "Software Engineering (cs.SE)",
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-21T02:21:51+00:00",
          "link": "https://arxiv.org/abs/2507.15188v1",
          "size": "72kb",
          "version": "v1"
        }
      ],
      "title": "Cultural Impact on Requirements Engineering Activities: Bangladeshi Practitioners' View",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.15188",
        "HTML": "https://arxiv.org/html/2507.15188",
        "PDF": "https://arxiv.org/pdf/2507.15188"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper discusses cultural impacts on requirements engineering activities. It does not focus on creativity or involve it as a theme or process in the research, instead focusing on cultural understanding in the IT sector."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14909",
      "abstract": "The Endless Tuning is a design method for a reliable deployment of artificial intelligence based on a double mirroring process, which pursues both the goals of avoiding human replacement and filling the so-called responsibility gap (Matthias 2004). Originally depicted in (Fabris et al. 2024) and ensuing the relational approach urged therein, it was then actualized in a protocol, implemented in three prototypical applications regarding decision-making processes (respectively: loan granting, pneumonia diagnosis, and art style recognition) and tested with such as many domain experts. Step by step illustrating the protocol, giving insights concretely showing a different voice (Gilligan 1993) in the ethics of artificial intelligence, a philosophical account of technical choices (e.g., a reversed and hermeneutic deployment of XAI algorithms) will be provided in the present study together with the results of the experiments, focusing on user experience rather than statistical accuracy. Even thoroughly employing deep learning models, full control was perceived by the interviewees in the decision-making setting, while it appeared that a bridge can be built between accountability and liability in case of damage.",
      "authors": [
        "Elio Grande"
      ],
      "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "subjects": [
        "Artificial Intelligence (cs.AI)",
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-20T10:48:07+00:00",
          "link": "https://arxiv.org/abs/2507.14909v1",
          "size": "4815kb",
          "version": "v1"
        }
      ],
      "title": "The Endless Tuning. An Artificial Intelligence Design To Avoid Human Replacement and Trace Back Responsibilities",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14909",
        "HTML": "https://arxiv.org/html/2507.14909",
        "PDF": "https://arxiv.org/pdf/2507.14909"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "This paper is centered around AI deployment, ethics, and user experience, with no explicit focus on creativity or creative processes."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.15355",
      "abstract": "Adjusting visual parameters such as brightness and contrast is common in our everyday experiences. Finding the optimal parameter setting is challenging due to the large search space and the lack of an explicit objective function, leaving users to rely solely on their implicit preferences. Prior work has explored Preferential Bayesian Optimization (PBO) to address this challenge, involving users to iteratively select preferred designs from candidate sets. However, PBO often requires many rounds of preference comparisons, making it more suitable for designers than everyday end-users. We propose Meta-PO, a novel method that integrates PBO with meta-learning to improve sample efficiency. Specifically, Meta-PO infers prior users' preferences and stores them as models, which are leveraged to intelligently suggest design candidates for the new users, enabling faster convergence and more personalized results. An experimental evaluation of our method for appearance design tasks on 2D and 3D content showed that participants achieved satisfactory appearance in 5.86 iterations using Meta-PO when participants shared similar goals with a population (e.g., tuning for a ``warm'' look) and in 8 iterations even generalizes across divergent goals (e.g., from ``vintage'', ``warm'', to ``holiday''). Meta-PO makes personalized visual optimization more applicable to end-users through a generalizable, more efficient optimization conditioned on preferences, with the potential to scale interface personalization more broadly.",
      "authors": [
        "Zhipeng Li",
        "Yi-Chi Liao",
        "Christian Holz"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)",
        "Machine Learning (cs.LG)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-21T08:08:04+00:00",
          "link": "https://arxiv.org/abs/2507.15355v1",
          "size": "11230kb",
          "version": "v1"
        }
      ],
      "title": "Efficient Visual Appearance Optimization by Learning from Prior Preferences",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.15355",
        "HTML": "https://arxiv.org/html/2507.15355",
        "PDF": "https://arxiv.org/pdf/2507.15355"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "partial",
        "reason": "The paper discusses visual appearance optimization, tackling tasks such as tuning for specific visual attributes. While it involves user preferences, which are often associated with creative decisions, the main focus is on optimization rather than creativity itself. Creativity is a secondary theme."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.15743",
      "abstract": "Recent work has demonstrated the promise of conversational AI systems for diagnostic dialogue. However, real-world assurance of patient safety means that providing individual diagnoses and treatment plans is considered a regulated activity by licensed professionals. Furthermore, physicians commonly oversee other team members in such activities, including nurse practitioners (NPs) or physician assistants/associates (PAs). Inspired by this, we propose a framework for effective, asynchronous oversight of the Articulate Medical Intelligence Explorer (AMIE) AI system. We propose guardrailed-AMIE (g-AMIE), a multi-agent system that performs history taking within guardrails, abstaining from individualized medical advice. Afterwards, g-AMIE conveys assessments to an overseeing primary care physician (PCP) in a clinician cockpit interface. The PCP provides oversight and retains accountability of the clinical decision. This effectively decouples oversight from intake and can thus happen asynchronously. In a randomized, blinded virtual Objective Structured Clinical Examination (OSCE) of text consultations with asynchronous oversight, we compared g-AMIE to NPs/PAs or a group of PCPs under the same guardrails. Across 60 scenarios, g-AMIE outperformed both groups in performing high-quality intake, summarizing cases, and proposing diagnoses and management plans for the overseeing PCP to review. This resulted in higher quality composite decisions. PCP oversight of g-AMIE was also more time-efficient than standalone PCP consultations in prior work. While our study does not replicate existing clinical practices and likely underestimates clinicians' capabilities, our results demonstrate the promise of asynchronous oversight as a feasible paradigm for diagnostic AI systems to operate under expert human oversight for enhancing real-world care.",
      "authors": [
        "Elahe Vedadi",
        "David Barrett",
        "Natalie Harris",
        "Ellery Wulczyn",
        "Shashir Reddy",
        "Roma Ruparel",
        "Mike Schaekermann",
        "Tim Strother",
        "Ryutaro Tanno",
        "Yash Sharma",
        "Jihyeon Lee",
        "C\\'ian Hughes",
        "Dylan Slack",
        "Anil Palepu",
        "Jan Freyberg",
        "Khaled Saab",
        "Valentin Li\\'evin",
        "Wei-Hung Weng",
        "Tao Tu",
        "Yun Liu",
        "Nenad Tomasev",
        "Kavita Kulkarni",
        "S. Sara Mahdavi",
        "Kelvin Guu",
        "Jo\\\"elle Barral",
        "Dale R. Webster",
        "James Manyika",
        "Avinatan Hassidim",
        "Katherine Chou",
        "Yossi Matias",
        "Pushmeet Kohli",
        "Adam Rodman",
        "Vivek Natarajan",
        "Alan Karthikesalingam",
        "David Stutz"
      ],
      "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
      "subjects": [
        "Artificial Intelligence (cs.AI)",
        "Computation and Language (cs.CL)",
        "Human-Computer Interaction (cs.HC)",
        "Machine Learning (cs.LG)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-21T15:54:36+00:00",
          "link": "https://arxiv.org/abs/2507.15743v1",
          "size": "4531kb",
          "version": "v1"
        }
      ],
      "title": "Towards physician-centered oversight of conversational diagnostic AI",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.15743",
        "HTML": "https://arxiv.org/html/2507.15743",
        "PDF": "https://arxiv.org/pdf/2507.15743"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper discusses physician-centered oversight of conversational diagnostic AI and aims to enhance patient safety and efficiency in medical diagnostics. Creativity is not mentioned or implied as a theme or factor in the study."
      },
      "source": "arXiv"
    },
    {
      "id": "2505.21385",
      "abstract": "Reconstructing and understanding dynamic visual information (video) from brain EEG recordings is challenging due to the non-stationary nature of EEG signals, their low signal-to-noise ratio (SNR), and the limited availability of EEG-Video stimulus datasets. Most recent studies have focused on reconstructing static images from EEG recordings. In this work, we propose a framework to reconstruct dynamic visual stimuli from EEG data and conduct an in-depth study of the information encoded in EEG signals. Our approach first trains a feature extraction network using a triplet-based contrastive learning strategy within an EEG-video generation framework. The extracted EEG features are then used for video synthesis with a modified StyleGAN-ADA, which incorporates temporal information as conditioning. Additionally, we analyze how different brain regions contribute to processing dynamic visual stimuli. Through several empirical studies, we evaluate the effectiveness of our framework and investigate how much dynamic visual information can be inferred from EEG signals. The inferences we derive through our extensive studies would be of immense value to future research on extracting visual dynamics from EEG.",
      "authors": [
        "Prajwal Singh",
        "Anupam Sharma",
        "Pankaj Pandey",
        "Krishna Miyapuram and Shanmuganathan Raman"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-05-27T16:12:43+00:00",
          "link": "https://arxiv.org/abs/2505.21385v1",
          "size": "12352kb",
          "version": "v1"
        },
        {
          "date": "2025-07-19T17:06:53+00:00",
          "link": "https://arxiv.org/abs/2505.21385v2",
          "size": "29263kb",
          "version": "v2"
        }
      ],
      "title": "EEGVid: Dynamic Vision from EEG Brain Recordings, How much does EEG know?",
      "links": {
        "Abstract": "https://arxiv.org/abs/2505.21385",
        "HTML": "https://arxiv.org/html/2505.21385",
        "PDF": "https://arxiv.org/pdf/2505.21385"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper is focused on reconstructing dynamic visual information from EEG data, without any specific mention or consideration of creativity as part of its goals or outcomes."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14242",
      "abstract": "While Artificial Intelligence (AI) is not a new field, recent developments, especially with the release of generative tools like ChatGPT, have brought it to the forefront of the minds of industry workers and academic folk alike. There is currently much talk about AI and its ability to reshape many everyday processes as we know them through automation. It also allows users to expand their ideas by suggesting things they may not have thought of on their own and provides easier access to information. However, not all of the changes this technology will bring or has brought so far are positive; this is why it is extremely important for all modern people to recognize and understand the risks before using these tools and allowing them to cause harm. This work takes a position on better understanding many equity concerns and the spread of misinformation that result from new AI, in this case, specifically ChatGPT and deepfakes, and encouraging collaboration with law enforcement, developers, and users to reduce harm. Considering many academic sources, it warns against these issues, analyzing their cause and impact in fields including healthcare, education, science, academia, retail, and finance. Lastly, we propose a set of future-facing guidelines and policy considerations to solve these issues while still enabling innovation in these fields, this responsibility falling upon users, developers, and government entities.",
      "authors": [
        "Prerana Khatiwada",
        "Grace Donaher",
        "Jasymyn Navarro",
        "Lokesh Bhatta"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Computers and Society (cs.CY)",
        "Artificial Intelligence (cs.AI)",
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-17T21:19:47+00:00",
          "link": "https://arxiv.org/abs/2507.14242v1",
          "size": "60kb",
          "version": "v1"
        }
      ],
      "title": "Culling Misinformation from Gen AI: Toward Ethical Curation and Refinement",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14242",
        "HTML": "https://arxiv.org/html/2507.14242",
        "PDF": "https://arxiv.org/pdf/2507.14242"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "partial",
        "reason": "While the paper primarily addresses misinformation and ethical considerations of AI, it touches upon creativity in terms of AI's role in idea expansion and innovation, albeit as a secondary theme."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14494",
      "abstract": "We contribute an in-depth analysis of the workflows and tensions arising from generative AI (genAI) use in biomedical visualization (BioMedVis). Although genAI affords facile production of aesthetic visuals for biological and medical content, the architecture of these tools fundamentally limits the accuracy and trustworthiness of the depicted information, from imaginary (or fanciful) molecules to alien anatomy. Through 17 interviews with a diverse group of practitioners and researchers, we qualitatively analyze the concerns and values driving genAI (dis)use for the visual representation of spatially-oriented biomedical data. We find that BioMedVis experts, both in roles as developers and designers, use genAI tools at different stages of their daily workflows and hold attitudes ranging from enthusiastic adopters to skeptical avoiders of genAI. In contrasting the current use and perspectives on genAI observed in our study with predictions towards genAI in the visualization pipeline from prior work, our refocus the discussion of genAI's effects on projects in visualization in the here and now with its respective opportunities and pitfalls for future visualization research. At a time when public trust in science is in jeopardy, we are reminded to first do no harm, not just in biomedical visualization but in science communication more broadly. Our observations reaffirm the necessity of human intervention for empathetic design and assessment of accurate scientific visuals.",
      "authors": [
        "Roxanne Ziman",
        "Shehryar Saharan",
        "Ga\\\"el McGill",
        "Laura Garrison"
      ],
      "license": "http://creativecommons.org/licenses/by-sa/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-19T05:42:23+00:00",
          "link": "https://arxiv.org/abs/2507.14494v1",
          "size": "3293kb",
          "version": "v1"
        }
      ],
      "title": "\"It looks sexy but it's wrong.\" Tensions in creativity and accuracy using genAI for biomedical visualization",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14494",
        "HTML": "https://arxiv.org/html/2507.14494",
        "PDF": "https://arxiv.org/pdf/2507.14494"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "partial",
        "reason": "Although the primary focus is on the use of generative AI in biomedical visualization, creativity is a secondary theme discussed in terms of generating aesthetic visuals and the tensions between creativity and accuracy."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.15526",
      "abstract": "Mixed Reality (MR) head mounted displays (HMDs) offer a promising alternative to traditional Flight Simulator Training Device (FSTD) displays, providing immersion, realism and cost efficiency. However, these technologies require management of human factors; cybersickness, visual fatigue and ergonomic strain. If left unmitigated, these effects can hinder pilot performance and training outcomes. For safety critical fields like aviation, addressing human factors challenges is crucial for MR's training potential. This survey systematically reviews the current literature identifying key human factors challenges in MR HMD use in pilot training and examines strategies to mitigate these barriers. Drawing on existing industry standards set by a leading aviation authority, the review adopts a regulatory perspective to explore hardware, software, ergonomic, physiological and psychological interventions improving pilot comfort, safety and training effectiveness in an MR FSTD. Additionally, it evaluates which of these interventions are most appropriate and viable for MR pilot training under existing aviation training regulations, ensuring that technical requirements and pilot wellbeing remain balanced. The findings yield significant insights for the human dimensions of aviation simulation training, highlighting how regulatory considerations shape the practicality of mitigation measures. These insights inform emerging MR aviation training guidelines and best practices, supporting MR's readiness to enhance aviation training.",
      "authors": [
        "Antonio Perez",
        "Avinash Singh",
        "Jonathan Mitchell",
        "Philip Swadling"
      ],
      "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-21T11:51:30+00:00",
          "link": "https://arxiv.org/abs/2507.15526v1",
          "size": "861kb",
          "version": "v1"
        }
      ],
      "title": "Strategies to Manage Human Factors in Mixed Reality Pilot Training: A Survey",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.15526",
        "HTML": "https://arxiv.org/html/2507.15526",
        "PDF": "https://arxiv.org/pdf/2507.15526"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "This paper discusses human factors in mixed reality training for aviation. Creativity is not a theme or focus in this research."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.15072",
      "abstract": "Industrial warehouses are congested with moving forklifts, shelves and personnel, making robot teleoperation particularly risky and demanding for blind and low-vision (BLV) operators. Although accessible teleoperation plays a key role in inclusive workforce participation, systematic research on its use in industrial environments is limited, and few existing studies barely address multimodal guidance designed for BLV users. We present a novel multimodal guidance simulator that enables BLV users to control a mobile robot through a high-fidelity warehouse environment while simultaneously receiving synchronized visual, auditory, and haptic feedback. The system combines a navigation mesh with regular re-planning so routes remain accurate avoiding collisions as forklifts and human avatars move around the warehouse. Users with low vision are guided with a visible path line towards destination; navigational voice cues with clockwise directions announce upcoming turns, and finally proximity-based haptic feedback notifies the users of static and moving obstacles in the path. This real-time, closed-loop system offers a repeatable testbed and algorithmic reference for accessible teleoperation research. The simulator's design principles can be easily adapted to real robots due to the alignment of its navigation, speech, and haptic modules with commercial hardware, supporting rapid feasibility studies and deployment of inclusive telerobotic tools in actual warehouses.",
      "authors": [
        "Maisha Maimuna",
        "Minhaz Bin Farukee",
        "Sama Nikanfar",
        "Mahfuza Siddiqua",
        "Ayon Roy and Fillia Makedon"
      ],
      "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)",
        "Artificial Intelligence (cs.AI)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-20T18:14:55+00:00",
          "link": "https://arxiv.org/abs/2507.15072v1",
          "size": "12018kb",
          "version": "v1"
        }
      ],
      "title": "NavVI: A Telerobotic Simulation with Multimodal Feedback for Visually Impaired Navigation in Warehouse Environments",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.15072",
        "HTML": "https://arxiv.org/html/2507.15072",
        "PDF": "https://arxiv.org/pdf/2507.15072"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper focuses on a telerobotic simulation for visually impaired navigation, without a direct link to creativity."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.15502",
      "abstract": "Postoperative follow-up plays a crucial role in monitoring recovery and identifying complications. However, traditional approaches, typically involving bedside interviews and manual documentation, are time-consuming and labor-intensive. Although existing digital solutions, such as web questionnaires and intelligent automated calls, can alleviate the workload of nurses to a certain extent, they either deliver an inflexible scripted interaction or face private information leakage issues. To address these limitations, this paper introduces FollowUpBot, an LLM-powered edge-deployed robot for postoperative care and monitoring. It allows dynamic planning of optimal routes and uses edge-deployed LLMs to conduct adaptive and face-to-face conversations with patients through multiple interaction modes, ensuring data privacy. Moreover, FollowUpBot is capable of automatically generating structured postoperative follow-up reports for healthcare institutions by analyzing patient interactions during follow-up. Experimental results demonstrate that our robot achieves high coverage and satisfaction in follow-up interactions, as well as high report generation accuracy across diverse field types. The demonstration video is available at https://www.youtube.com/watch?v=_uFgDO7NoK0.",
      "authors": [
        "Chen Chen",
        "Jianing Yin",
        "Jiannong Cao",
        "Zhiyuan Wen",
        "Mingjin Zhang",
        "Weixun Gao",
        "Xiang Wang",
        "Haihua Shu"
      ],
      "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-21T11:07:49+00:00",
          "link": "https://arxiv.org/abs/2507.15502v1",
          "size": "1222kb",
          "version": "v1"
        }
      ],
      "title": "FollowUpBot: An LLM-Based Conversational Robot for Automatic Postoperative Follow-up",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.15502",
        "HTML": "https://arxiv.org/html/2507.15502",
        "PDF": "https://arxiv.org/pdf/2507.15502"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper is focused on postoperative follow-up using an LLM-based robot. It revolves around healthcare and monitoring, not creativity."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14372",
      "abstract": "The introduction of large language models has brought rapid progress on Text-to-SQL benchmarks, but it is not yet easy to build a working enterprise solution. In this paper, we present insights from building an internal chatbot that enables LinkedIn's product managers, engineers, and operations teams to self-serve data insights from a large, dynamic data lake. Our approach features three components. First, we construct a knowledge graph that captures up-to-date semantics by indexing database metadata, historical query logs, wikis, and code. We apply clustering to identify relevant tables for each team or product area. Second, we build a Text-to-SQL agent that retrieves and ranks context from the knowledge graph, writes a query, and automatically corrects hallucinations and syntax errors. Third, we build an interactive chatbot that supports various user intents, from data discovery to query writing to debugging, and displays responses in rich UI elements to encourage follow-up chats. Our chatbot has over 300 weekly users. Expert review shows that 53% of its responses are correct or close to correct on an internal benchmark set. Through ablation studies, we identify the most important knowledge graph and modeling components, offering a practical path for developing enterprise Text-to-SQL solutions.",
      "authors": [
        "Albert Chen",
        "Manas Bundele",
        "Gaurav Ahlawat",
        "Patrick Stetz",
        "Zhitao Wang",
        "Qiang Fei",
        "Donghoon Jung",
        "Audrey Chu",
        "Bharadwaj Jayaraman",
        "Ayushi Panth",
        "Yatin Arora",
        "Sourav Jain",
        "Renjith Varma",
        "Alexey Ilin",
        "Iuliia Melnychuk",
        "Chelsea Chueh",
        "Joyan Sil and Xiaofeng Wang"
      ],
      "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/",
      "subjects": [
        "Computation and Language (cs.CL)",
        "Artificial Intelligence (cs.AI)",
        "Databases (cs.DB)",
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-18T21:39:17+00:00",
          "link": "https://arxiv.org/abs/2507.14372v1",
          "size": "4187kb",
          "version": "v1"
        }
      ],
      "title": "Text-to-SQL for Enterprise Data Analytics",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14372",
        "HTML": "https://arxiv.org/html/2507.14372",
        "PDF": "https://arxiv.org/pdf/2507.14372"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper centers on data analytics and the development of a Text-to-SQL system for enterprise solutions, with no mention or emphasis on creativity."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.15454",
      "abstract": "3D Gaussian Splatting is renowned for its high-fidelity reconstructions and real-time novel view synthesis, yet its lack of semantic understanding limits object-level perception. In this work, we propose ObjectGS, an object-aware framework that unifies 3D scene reconstruction with semantic understanding. Instead of treating the scene as a unified whole, ObjectGS models individual objects as local anchors that generate neural Gaussians and share object IDs, enabling precise object-level reconstruction. During training, we dynamically grow or prune these anchors and optimize their features, while a one-hot ID encoding with a classification loss enforces clear semantic constraints. We show through extensive experiments that ObjectGS not only outperforms state-of-the-art methods on open-vocabulary and panoptic segmentation tasks, but also integrates seamlessly with applications like mesh extraction and scene editing. Project page: https://ruijiezhu94.github.io/ObjectGS_page",
      "authors": [
        "Ruijie Zhu",
        "Mulin Yu",
        "Linning Xu",
        "Lihan Jiang",
        "Yixuan Li",
        "Tianzhu Zhang",
        "Jiangmiao Pang",
        "Bo Dai"
      ],
      "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
      "subjects": [
        "Graphics (cs.GR)",
        "Artificial Intelligence (cs.AI)",
        "Computer Vision and Pattern Recognition (cs.CV)",
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-21T10:06:23+00:00",
          "link": "https://arxiv.org/abs/2507.15454v1",
          "size": "45484kb",
          "version": "v1"
        }
      ],
      "title": "ObjectGS: Object-aware Scene Reconstruction and Scene Understanding via Gaussian Splatting",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.15454",
        "HTML": "https://arxiv.org/html/2507.15454",
        "PDF": "https://arxiv.org/pdf/2507.15454"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper is focused on 3D scene reconstruction and semantic understanding. It explores object-level precision and visualization but does not address creativity or creative processes."
      },
      "source": "arXiv"
    },
    {
      "id": "2507.14818",
      "abstract": "Mobile games are becoming a vital medium for social interaction, offering a platform that transcends geographical boundaries. An increasing number of visually impaired individuals are engaging in mobile gaming to connect, collaborate, compete, and build friendships. In China, visually impaired communities face significant social challenges in offline settings, making mobile games a crucial avenue for socialization. However, the design of mobile games and their mapping to real-world environments significantly shape their social gaming experiences. This study explores how visually impaired players in China navigate socialization and integrate into gaming communities. Through interviews with 30 visually impaired players, we found that while mobile games fulfill many of their social needs, technological barriers and insufficient accessibility features, and internal community divisions present significant challenges to their participation. This research sheds light on their social experiences and offers insights for designing more inclusive and accessible mobile games.",
      "authors": [
        "Zihe Ran",
        "Xiyu Li",
        "Qing Xiao",
        "Yanyun Wang",
        "Franklin Mingzhe Li",
        "Zhicong Lu"
      ],
      "license": "http://creativecommons.org/licenses/by/4.0/",
      "subjects": [
        "Human-Computer Interaction (cs.HC)",
        "Computers and Society (cs.CY)"
      ],
      "submission_historys": [
        {
          "date": "2025-07-20T04:30:05+00:00",
          "link": "https://arxiv.org/abs/2507.14818v1",
          "size": "101kb",
          "version": "v1"
        }
      ],
      "title": "Understanding How Visually Impaired Players Socialize in Mobile Games",
      "links": {
        "Abstract": "https://arxiv.org/abs/2507.14818",
        "HTML": "https://arxiv.org/html/2507.14818",
        "PDF": "https://arxiv.org/pdf/2507.14818"
      },
      "relevance": {
        "keyword": "creativity",
        "level": "irrelevant",
        "reason": "The paper explores socialization of visually impaired players in mobile games, without any focus on creative processes or creativity-related research."
      },
      "source": "arXiv"
    }
  ],
  "subjects": [
    "Computer Vision and Pattern Recognition (cs.CV)",
    "Computation and Language (cs.CL)",
    "Databases (cs.DB)",
    "Sound (cs.SD)",
    "Systems and Control (eess.SY)",
    "Cryptography and Security (cs.CR)",
    "Robotics (cs.RO)",
    "Artificial Intelligence (cs.AI)",
    "Atmospheric and Oceanic Physics (physics.ao-ph)",
    "Adaptation and Self-Organizing Systems (nlin.AO)",
    "Systems and Control (cs.SY)",
    "Emerging Technologies (cs.ET)",
    "Signal Processing (eess.SP)",
    "Audio and Speech Processing (eess.AS)",
    "Social and Information Networks (cs.SI)",
    "Computers and Society (cs.CY)",
    "Software Engineering (cs.SE)",
    "Human-Computer Interaction (cs.HC)",
    "Graphics (cs.GR)",
    "Machine Learning (cs.LG)"
  ],
  "prompt": {
    "creativity": "\nYou are an expert in information retrieval. I will provide you with a list of research papers from arXiv, specifically in the *cs.HC* (Human-Computer Interaction) category.\n\nYour task is to analyze each paper and determine its relevance to the topic of **Creativity**.\n\n\n### Classify each paper into one of the following relevance levels\n\n- `core` — Creativity is a **primary focus**\n  - The paper directly studies or simulates creativity, with a clear focus on creativity.\n  - Includes creative tasks, co-creative systems, or creativity evaluation metrics.\n  - The title and abstract explicitly mention creativity, and the research questions are directly related to creativity.\n- `partial` — Creativity is a **secondary theme**\n  - Part of the paper relates to creativity; it is treated as an analytical dimension or design goal but not the main objective (e.g., user creativity, design support).\n  - Creativity may appear in discussions, experiments, or auxiliary applications.\n  - Creativity is presented as a supporting topic (e.g., evaluation criteria, user feedback).\n- `irrelevant` — **No clear connection** to creativity\n  - The paper does not address creativity as a topic.\n  - Focuses on unrelated technical content (e.g., compression, security, optimization).\n  - If creativity is mentioned, it is only superficial and lacks substantive content.\n\n\n### Return your results in the following JSON format\n\n```json\n{\n  \"result\": [\n    {\n      \"id\": \"paper id\",\n      \"level\": \"core | partial | irrelevant\",\n      \"reason\": \"Brief justification based on the paper content\"\n    },\n    {\n      \"id\": \"paper id\",\n      \"level\": \"core | partial | irrelevant\",\n      \"reason\": \"Brief justification based on the paper content\"\n    }\n  ]\n}\n```\n\nBe concise but specific in your reasoning, referencing key terms or sections when applicable.\n"
  },
  "description": "Data source: https://arxiv.org/list/cs.HC/new",
  "level_tatistics": {
    "partial": 17,
    "core": 5,
    "irrelevant": 42
  },
  "arxiv_update_date": "2025-07-21",
  "updated_at": "2025-07-22 11:00:45"
}