{
  "data": [
    {
      "id": "2506.18711",
      "abstract": "The goal of this study is to identify factors that support and enhance older adults' creative experiences in human-robot co-creativity. Because the research into the use of robots for creativity support with older adults remains underexplored, we carried out an exploratory case study. We took a participatory approach and collaborated with professional art educators to design a course Drawing with Robots for adults aged 65 and over. The course featured human-human and human-robot drawing activities with various types of robots. We observed collaborative drawing interactions, interviewed participants on their experiences, and analyzed collected data. Findings show that participants preferred acting as curators, evaluating creative suggestions from the robot in a teacher or coach role. When we enhanced a robot with a multimodal Large Language Model (LLM), participants appreciated its spoken dialogue capabilities. They reported however, that the robot's feedback sometimes lacked an understanding of the context, and sensitivity to their artistic goals and preferences. Our findings highlight the potential of LLM-enhanced robots to support creativity and offer future directions for advancing human-robot co-creativity with older adults.",
      "authors": [
        "Bossema, Marianne",
        "Allouch, Somaya Ben",
        "Plaat, Aske",
        "Saunders, Rob"
      ],
      "last_revised_date": "2025/06/23",
      "links": {
        "HTML (experimental)": "https://arxiv.org/html/2506.18711v1",
        "Other Formats": "https://arxiv.org/format/2506.18711",
        "TeX Source": "https://arxiv.org/src/2506.18711",
        "View PDF": "https://arxiv.org/pdf/2506.18711"
      },
      "relevance": {
        "reason": "The paper is explicitly focused on creativity, particularly in the context of human-robot co-creativity with older adults. It explores how robots can support and enhance creative experiences, indicating a strong emphasis on creativity.",
        "keyword": "creativity",
        "level": "strong"
      },
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "details": "Mon, 23 Jun 2025 14:49:03 UTC (2,306 KB)",
          "version": "[v1]"
        }
      ],
      "submitted_date": "2025/06/23",
      "title": "LLM-enhanced Interactions in Human-Robot Collaborative Drawing with Older Adults",
      "type": "paper",
      "source": "arxiv"
    },
    {
      "id": "2506.18706",
      "abstract": "The integration of Generative AI (GenAI) into creative communities, like fanfiction, is reshaping how stories are created, shared, and valued. This study investigates the perceptions of 157 active fanfiction members, both readers and writers, regarding AI-generated content in fanfiction. Our research explores the impact of GenAI on community dynamics, examining how AI affects the participatory and collaborative nature of these spaces. The findings reveal responses ranging from cautious acceptance of AI's potential for creative enhancement to concerns about authenticity, ethical issues, and the erosion of human-centered values. Participants emphasized the importance of transparency and expressed worries about losing social connections. Our study highlights the need for thoughtful AI integration in creative platforms using design interventions that enable ethical practices, promote transparency, increase engagement and connection, and preserve the community's core values.",
      "authors": [
        "Alfassi, Roi",
        "Cooper, Angelora",
        "Mitchell, Zoe",
        "Calabro, Mary",
        "Shaer, Orit",
        "Mokryn, Osnat"
      ],
      "last_revised_date": "2025/06/23",
      "links": {
        "HTML (experimental)": "https://arxiv.org/html/2506.18706v1",
        "Other Formats": "https://arxiv.org/format/2506.18706",
        "TeX Source": "https://arxiv.org/src/2506.18706",
        "View PDF": "https://arxiv.org/pdf/2506.18706"
      },
      "relevance": {
        "reason": "The paper focuses on the impact of Generative AI on creativity within the fanfiction community. It analyzes how AI influences creative content creation and explores community perspectives on creativity, making creativity a central theme of the study.",
        "keyword": "creativity",
        "level": "strong"
      },
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "details": "Mon, 23 Jun 2025 14:45:37 UTC (1,480 KB)",
          "version": "[v1]"
        }
      ],
      "submitted_date": "2025/06/23",
      "title": "Fanfiction in the Age of AI: Community Perspectives on Creativity, Authenticity and Adoption",
      "type": "paper",
      "source": "arxiv"
    },
    {
      "id": "2506.18605",
      "abstract": "As autonomous vehicles become more integrated into shared human environments, effective communication with road users is essential for ensuring safety. While previous research has focused on developing external Human-Machine Interfaces (eHMIs) to facilitate these interactions, we argue that involving users in the early creative stages can help address key challenges in the development of this technology. To explore this, our study adopts a participatory, crowd-sourced approach to gather user-generated ideas for eHMI designs. Participants were first introduced to fundamental eHMI concepts, equipping them to sketch their own design ideas in response to scenarios with varying levels of perceived risk. An initial pre-study with 29 participants showed that while they actively engaged in the process, there was a need to refine task objectives and encourage deeper reflection. To address these challenges, a follow-up study with 50 participants was conducted. The results revealed a strong preference for autonomous vehicles to communicate their awareness and intentions using lights (LEDs and projections), symbols, and text. Participants' sketches prioritized multi-modal communication, directionality, and adaptability to enhance clarity, consistently integrating familiar vehicle elements to improve intuitiveness.",
      "authors": [
        "Cumbal, Ronald",
        "Broo, Didem Gurdur",
        "Castellano, Ginevra"
      ],
      "last_revised_date": "2025/06/23",
      "links": {
        "HTML (experimental)": "https://arxiv.org/html/2506.18605v1",
        "Other Formats": "https://arxiv.org/format/2506.18605",
        "TeX Source": "https://arxiv.org/src/2506.18605",
        "View PDF": "https://arxiv.org/pdf/2506.18605"
      },
      "relevance": {
        "reason": "The paper involves creativity in the sense of users being engaged in the creative process of designing eHMIs for autonomous vehicles. However, creativity is not the main focus; the primary aim is to improve vehicle-pedestrian communication.",
        "keyword": "creativity",
        "level": "weak"
      },
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "details": "Mon, 23 Jun 2025 13:05:16 UTC (1,279 KB)",
          "version": "[v1]"
        }
      ],
      "submitted_date": "2025/06/23",
      "title": "Crowdsourcing eHMI Designs: A Participatory Approach to Autonomous Vehicle-Pedestrian Communication",
      "type": "paper",
      "source": "arxiv"
    },
    {
      "id": "2506.18455",
      "abstract": "We introduce CODS (Computational Optimization in Design Space), a theoretical model that frames computational design as a constrained optimization problem over a structured, multi-dimensional design space. Unlike existing methods that rely on handcrafted heuristics or domain-specific rules, CODS provides a generalizable and interpretable framework that supports diverse design tasks. Given a user requirement and a well-defined design space, CODS automatically derives soft and hard constraints using large language models through a structured prompt engineering pipeline. These constraints guide the optimization process to generate design solutions that are coherent, expressive, and aligned with user intent. We validate our approach across two domains-visualization design and knitwear generation-demonstrating superior performance in design quality, intent alignment, and user preference compared to existing LLM-based methods. CODS offers a unified foundation for scalable, controllable, and AI-powered design automation.",
      "authors": [
        "Cao, Nan",
        "Qi, Xiaoyu",
        "Chen, Chuer",
        "Yan, Xiaoke"
      ],
      "last_revised_date": "2025/06/23",
      "links": {
        "HTML (experimental)": "https://arxiv.org/html/2506.18455v1",
        "Other Formats": "https://arxiv.org/format/2506.18455",
        "TeX Source": "https://arxiv.org/src/2506.18455",
        "View PDF": "https://arxiv.org/pdf/2506.18455"
      },
      "relevance": {
        "reason": "The paper discusses computational design optimization, which may involve creative processes but does not explicitly focus on creativity as a primary subject. It mentions 'design solutions that are coherent, expressive, and aligned with user intent,' which can relate to creativity but not as a core element.",
        "keyword": "creativity",
        "level": "weak"
      },
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "details": "Mon, 23 Jun 2025 09:47:14 UTC (27,641 KB)",
          "version": "[v1]"
        }
      ],
      "submitted_date": "2025/06/23",
      "title": "CODS : A Theoretical Model for Computational Design Based on Design Space",
      "type": "paper",
      "source": "arxiv"
    },
    {
      "id": "2502.08854",
      "abstract": "Widespread integration of Generative AI tools is transforming white-collar work, reshaping how workers define their roles, manage their tasks, and collaborate with peers. This has created a need to develop an overarching understanding of common worker-driven patterns around these transformations. To fill this gap, we conducted a systematic literature review of 23 studies from the ACM Digital Library that focused on workers' lived-experiences and practitioners with GenAI. Our findings reveal that while many professionals have delegated routine tasks to GenAI to focus on core responsibilities, they have also taken on new forms of AI managerial labor to monitor and refine GenAI outputs. Additionally, practitioners have restructured collaborations, sometimes bypassing traditional peer and subordinate interactions in favor of GenAI assistance. These shifts have fragmented cohesive tasks into piecework creating tensions around role boundaries and professional identity. Our analysis suggests that current frameworks, like job crafting, need to evolve to address the complexities of GenAI-driven transformations.",
      "authors": [
        "Law, Matthew",
        "Varanasi, Rama Adithya"
      ],
      "last_revised_date": "2025/06/22",
      "links": {
        "HTML (experimental)": "https://arxiv.org/html/2502.08854v2",
        "Other Formats": "https://arxiv.org/format/2502.08854",
        "TeX Source": "https://arxiv.org/src/2502.08854",
        "View PDF": "https://arxiv.org/pdf/2502.08854"
      },
      "relevance": {
        "reason": "The paper discusses the impact of Generative AI on work, which may involve some elements of creativity in redefining roles and tasks. However, creativity is not the main focus; the emphasis is on job transformations and role management.",
        "keyword": "creativity",
        "level": "weak"
      },
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "details": "Thu, 13 Feb 2025 00:13:49 UTC (499 KB)",
          "link": "/",
          "version": "[v1]"
        },
        {
          "details": "Sun, 22 Jun 2025 18:00:43 UTC (427 KB)",
          "version": "[v2]"
        }
      ],
      "submitted_date": "2025/02/13",
      "title": "Generative AI & Changing Work: Systematic Review of Practitioner-led Work Transformations through the Lens of Job Crafting",
      "type": "paper",
      "source": "arxiv"
    },
    {
      "id": "2506.18143",
      "abstract": "Vocals harmonizers are powerful tools to help solo vocalists enrich their melodies with harmonically supportive voices. These tools exist in various forms, from commercially available pedals and software to custom-built systems, each employing different methods to generate harmonies. Traditional harmonizers often require users to manually specify a key or tonal center, while others allow pitch selection via an external keyboard-both approaches demanding some degree of musical expertise. The AI Harmonizer introduces a novel approach by autonomously generating musically coherent four-part harmonies without requiring prior harmonic input from the user. By integrating state-of-the-art generative AI techniques for pitch detection and voice modeling with custom-trained symbolic music models, our system arranges any vocal melody into rich choral textures. In this paper, we present our methods, explore potential applications in performance and composition, and discuss future directions for real-time implementations. While our system currently operates offline, we believe it represents a significant step toward AI-assisted vocal performance and expressive musical augmentation. We release our implementation on GitHub.",
      "authors": [
        "Blanchard, Lancelot",
        "Holt, Cameron",
        "Paradiso, Joseph A."
      ],
      "last_revised_date": "2025/06/22",
      "links": {
        "HTML (experimental)": "https://arxiv.org/html/2506.18143v1",
        "Other Formats": "https://arxiv.org/format/2506.18143",
        "TeX Source": "https://arxiv.org/src/2506.18143",
        "View PDF": "https://arxiv.org/pdf/2506.18143"
      },
      "relevance": {
        "reason": "The paper introduces an AI system that enriches vocal performances, which can be seen as enhancing creative musical expression. However, creativity is not the central focus, as the paper primarily discusses technical aspects of harmonization and AI implementation.",
        "keyword": "creativity",
        "level": "weak"
      },
      "subjects": [
        "Human-Computer Interaction (cs.HC)",
        "Artificial Intelligence (cs.AI)",
        "Sound (cs.SD)",
        "Audio and Speech Processing (eess.AS)"
      ],
      "submission_historys": [
        {
          "details": "Sun, 22 Jun 2025 19:13:31 UTC (757 KB)",
          "version": "[v1]"
        }
      ],
      "submitted_date": "2025/06/22",
      "title": "AI Harmonizer: Expanding Vocal Expression with a Generative Neurosymbolic Music AI System",
      "type": "paper",
      "source": "arxiv"
    },
    {
      "id": "2506.18196",
      "abstract": "In this work, we explore the musical interface potential of the MindCube, an interactive device designed to study emotions. Embedding diverse sensors and input devices, this interface resembles a fidget cube toy commonly used to help users relieve their stress and anxiety. As such, it is a particularly well-suited controller for musical systems that aim to help with emotion regulation. In this regard, we present two different mappings for the MindCube, with and without AI. With our generative AI mapping, we propose a way to infuse meaning within a latent space and techniques to navigate through it with an external controller. We discuss our results and propose directions for future work.",
      "authors": [
        "Liu, Fangzheng",
        "Blanchard, Lancelot",
        "Haddad, Don D.",
        "Paradiso, Joseph A."
      ],
      "last_revised_date": "2025/06/22",
      "links": {
        "HTML (experimental)": "https://arxiv.org/html/2506.18196v1",
        "Other Formats": "https://arxiv.org/format/2506.18196",
        "TeX Source": "https://arxiv.org/src/2506.18196",
        "View PDF": "https://arxiv.org/pdf/2506.18196"
      },
      "relevance": {
        "reason": "The paper focuses on emotion regulation and musical interfaces but touches on creativity through the exploration of interactive devices and generative AI, which can be relevant to creative processes.",
        "keyword": "creativity",
        "level": "weak"
      },
      "subjects": [
        "Human-Computer Interaction (cs.HC)",
        "Artificial Intelligence (cs.AI)",
        "Sound (cs.SD)",
        "Audio and Speech Processing (eess.AS)"
      ],
      "submission_historys": [
        {
          "details": "Sun, 22 Jun 2025 23:09:37 UTC (4,322 KB)",
          "version": "[v1]"
        }
      ],
      "submitted_date": "2025/06/22",
      "title": "Two Sonification Methods for the MindCube",
      "type": "paper",
      "source": "arxiv"
    },
    {
      "id": "2309.10448",
      "abstract": "When working with generative artificial intelligence (AI), users may see productivity gains, but the AI-generated content may not match their preferences exactly. To study this effect, we introduce a Bayesian framework in which heterogeneous users choose how much information to share with the AI, facing a trade-off between output fidelity and communication cost. We show that the interplay between these individual-level decisions and AI training may lead to societal challenges. Outputs may become more homogenized, especially when the AI is trained on AI-generated content, potentially triggering a homogenization death spiral. And any AI bias may propagate to become societal bias. A solution to the homogenization and bias issues is to reduce human-AI interaction frictions and enable users to flexibly share information, leading to personalized outputs without sacrificing productivity.",
      "authors": [
        "Castro, Francisco",
        "Gao, Jian",
        "Martin, Sébastien"
      ],
      "last_revised_date": "2025/06/22",
      "links": {
        "Other Formats": "https://arxiv.org/format/2309.10448",
        "TeX Source": "https://arxiv.org/src/2309.10448",
        "View PDF": "https://arxiv.org/pdf/2309.10448"
      },
      "relevance": {
        "reason": "The paper focuses on human-AI interactions and societal implications, such as homogenization and bias. While it discusses personalization and user preferences, which can be related to creativity, creativity is not the primary focus of the study.",
        "keyword": "creativity",
        "level": "weak"
      },
      "subjects": [
        "Artificial Intelligence (cs.AI)",
        "Human-Computer Interaction (cs.HC)",
        "General Economics (econ.GN)"
      ],
      "submission_historys": [
        {
          "details": "Tue, 19 Sep 2023 09:09:59 UTC (1,585 KB)",
          "link": "/",
          "version": "[v1]"
        },
        {
          "details": "Fri, 13 Oct 2023 00:52:52 UTC (1,584 KB)",
          "link": "/",
          "version": "[v2]"
        },
        {
          "details": "Sun, 22 Jun 2025 15:45:31 UTC (2,313 KB)",
          "version": "[v3]"
        }
      ],
      "submitted_date": "2023/09/19",
      "title": "Human-AI Interactions and Societal Pitfalls",
      "tasks": [],
      "type": "paper",
      "source": "arxiv"
    },
    {
      "id": "2505.16023",
      "abstract": "As large language models (LLMs) are used in complex writing workflows, users engage in multi-turn interactions to steer generations to better fit their needs. Rather than passively accepting output, users actively refine, explore, and co-construct text. We conduct a large-scale analysis of this collaborative behavior for users engaged in writing tasks in the wild with two popular AI assistants, Bing Copilot and WildChat. Our analysis goes beyond simple task classification or satisfaction estimation common in prior work and instead characterizes how users interact with LLMs through the course of a session. We identify prototypical behaviors in how users interact with LLMs in prompts following their original request. We refer to these as Prototypical Human-AI Collaboration Behaviors (PATHs) and find that a small group of PATHs explain a majority of the variation seen in user-LLM interaction. These PATHs span users revising intents, exploring texts, posing questions, adjusting style or injecting new content. Next, we find statistically significant correlations between specific writing intents and PATHs, revealing how users' intents shape their collaboration behaviors. We conclude by discussing the implications of our findings on LLM alignment.",
      "authors": [
        "Mysore, Sheshera",
        "Das, Debarati",
        "Cao, Hancheng",
        "Sarrafzadeh, Bahareh"
      ],
      "last_revised_date": "2025/06/21",
      "links": {
        "Other Formats": "https://arxiv.org/format/2505.16023",
        "TeX Source": "https://arxiv.org/src/2505.16023",
        "View PDF": "https://arxiv.org/pdf/2505.16023"
      },
      "relevance": {
        "reason": "The paper explores human-AI collaboration in writing tasks, which may involve aspects of creativity such as refining, exploring, and co-constructing text. However, the focus is on interaction patterns and collaboration behaviors rather than creativity itself.",
        "keyword": "creativity",
        "level": "weak"
      },
      "subjects": [
        "Computation and Language (cs.CL)",
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "details": "Wed, 21 May 2025 21:13:01 UTC (28,607 KB)",
          "link": "/",
          "version": "[v1]"
        },
        {
          "details": "Fri, 23 May 2025 16:04:18 UTC (28,607 KB)",
          "link": "/",
          "version": "[v2]"
        },
        {
          "details": "Sat, 21 Jun 2025 22:54:21 UTC (29,025 KB)",
          "version": "[v3]"
        }
      ],
      "submitted_date": "2025/05/21",
      "title": "Prototypical Human-AI Collaboration Behaviors from LLM-Assisted Writing in the Wild",
      "tasks": [],
      "type": "paper",
      "source": "arxiv"
    },
    {
      "id": "2506.17467",
      "abstract": "Large language models (LLMs) have shown significant potential to change how we write, communicate, and create, leading to rapid adoption across society. This dissertation examines how individuals and institutions are adapting to and engaging with this emerging technology through three research directions. First, I demonstrate how the institutional adoption of AI detectors introduces systematic biases, particularly disadvantaging writers of non-dominant language varieties, highlighting critical equity concerns in AI governance. Second, I present novel population-level algorithmic approaches that measure the increasing adoption of LLMs across writing domains, revealing consistent patterns of AI-assisted content in academic peer reviews, scientific publications, consumer complaints, corporate communications, job postings, and international organization press releases. Finally, I investigate LLMs' capability to provide feedback on research manuscripts through a large-scale empirical analysis, offering insights into their potential to support researchers who face barriers in accessing timely manuscript feedback, particularly early-career researchers and those from under-resourced settings.",
      "authors": [
        "Liang, Weixin"
      ],
      "last_revised_date": "2025/06/20",
      "links": {
        "Other Formats": "https://arxiv.org/format/2506.17467",
        "TeX Source": "https://arxiv.org/src/2506.17467",
        "View PDF": "https://arxiv.org/pdf/2506.17467"
      },
      "relevance": {
        "reason": "The abstract mentions how LLMs change how we create, which relates to creativity. However, the main focus is on adapting to LLMs, AI governance, and equity concerns, rather than creativity itself.",
        "keyword": "creativity",
        "level": "weak"
      },
      "subjects": [
        "Computation and Language (cs.CL)",
        "Artificial Intelligence (cs.AI)",
        "Computers and Society (cs.CY)",
        "Human-Computer Interaction (cs.HC)",
        "Machine Learning (cs.LG)"
      ],
      "submission_historys": [
        {
          "details": "Fri, 20 Jun 2025 20:15:09 UTC (19,294 KB)",
          "version": "[v1]"
        }
      ],
      "submitted_date": "2025/06/20",
      "title": "Computational Approaches to Understanding Large Language Model Impact on Writing and Information Ecosystems",
      "type": "paper",
      "source": "arxiv"
    }
  ],
  "subjects": [
    "Computation and Language (cs.CL)",
    "Sound (cs.SD)",
    "Artificial Intelligence (cs.AI)",
    "Audio and Speech Processing (eess.AS)",
    "Computers and Society (cs.CY)",
    "Human-Computer Interaction (cs.HC)",
    "Machine Learning (cs.LG)",
    "General Economics (econ.GN)"
  ]
}