{
  "data": [
    {
      "id": "2506.17116",
      "abstract": "In this workshop paper, we discuss the potential for measures of user-centric benefits (such as emotional well-being) that could be explored when evaluating explainable AI (XAI) systems within the arts. As a background to this, we draw from our recent review of creativity support tool (CST) evaluations, that found a paucity of studies evaluating CSTs for user-centric measures that benefit the user themselves. Specifically, we discuss measures of: (1) developing intrinsic abilities, (2) emotional well-being, (3) self-reflection, and (4) self-perception. By discussing these user-centric measures within the context of XAI and the arts, we wish to provoke discussion regarding the potential of such measures.",
      "authors": [
        "Cox, Samuel Rhys",
        "Djernæs, Helena Bøjer",
        "van Berkel, Niels"
      ],
      "last_revised_date": "2025/06/20",
      "links": {
        "HTML (experimental)": "https://arxiv.org/html/2506.17116v1",
        "Other Formats": "https://arxiv.org/format/2506.17116",
        "TeX Source": "https://arxiv.org/src/2506.17116",
        "View PDF": "https://arxiv.org/pdf/2506.17116"
      },
      "relevance": {
        "reason": "The paper discusses creativity support tools (CST) and evaluates measures that can enhance user-centric benefits in a creative context, explicitly linking explainable AI with creativity and the arts.",
        "keyword": "creativity",
        "level": "strong"
      },
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "details": "Fri, 20 Jun 2025 16:15:15 UTC (98 KB)",
          "version": "[v1]"
        }
      ],
      "submitted_date": "2025/06/20",
      "title": "Reflecting Human Values in XAI: Emotional and Reflective Benefits in Creativity Support Tools",
      "type": "paper",
      "source": "arxiv"
    },
    {
      "id": "2506.16874",
      "abstract": "The integration of Generative Artificial Intelligence (GenAI) in K-6 project-based art courses presents both opportunities and challenges for enhancing creativity, engagement, and group collaboration. This study introduces a four-phase field study, involving in total two experienced K-6 art teachers and 132 students in eight offline course sessions, to investigate the usage and impact of GenAI. Specifically, based on findings in Phases 1 and 2, we developed AskArt, an interactive interface that combines DALL-E and GPT and is tailored to support elementary school students in their art projects, and deployed it in Phases 3 and 4. Our findings revealed the benefits of GenAI in providing background information, inspirations, and personalized guidance. However, challenges in query formulation for generating expected content were also observed. Moreover, students employed varied collaboration strategies, and teachers noted increased engagement alongside concerns regarding misuse and interface suitability. This study offers insights into the effective integration of GenAI in elementary education, presents AskArt as a practical tool, and provides recommendations for educators and researchers to enhance project-based learning with GenAI technologies.",
      "authors": [
        "Wang, Zhiqing",
        "Fan, Haoxiang",
        "Wu, Shiwei",
        "Chen, Qiaoyi",
        "Liang, Yongqi",
        "Peng, Zhenhui"
      ],
      "last_revised_date": "2025/06/20",
      "links": {
        "HTML (experimental)": "https://arxiv.org/html/2506.16874v1",
        "Other Formats": "https://arxiv.org/format/2506.16874",
        "TeX Source": "https://arxiv.org/src/2506.16874",
        "View PDF": "https://arxiv.org/pdf/2506.16874"
      },
      "relevance": {
        "reason": "The paper explicitly focuses on enhancing creativity in elementary art courses through the integration of Generative AI, highlighting benefits such as providing inspirations and personalized guidance, which directly relate to fostering creativity.",
        "keyword": "creativity",
        "level": "strong"
      },
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "details": "Fri, 20 Jun 2025 09:46:09 UTC (9,820 KB)",
          "version": "[v1]"
        }
      ],
      "submitted_date": "2025/06/20",
      "title": "Exploring the Usage of Generative AI for Group Project-Based Offline Art Courses in Elementary Schools",
      "type": "paper",
      "source": "arxiv"
    },
    {
      "id": "2502.04599",
      "abstract": "Linkography -- the analysis of links between the design moves that make up an episode of creative ideation or design -- can be used for both visual and quantitative assessment of creative activity traces. Traditional linkography, however, is time-consuming, requiring a human coder to manually annotate both the design moves within an episode and the connections between them. As a result, linkography has not yet been much applied at scale. To address this limitation, we introduce fuzzy linkography: a means of automatically constructing a linkograph from a sequence of recorded design moves via a \"fuzzy\" computational model of semantic similarity, enabling wider deployment and new applications of linkographic techniques. We apply fuzzy linkography to three markedly different kinds of creative activity traces (text-to-image prompting journeys, LLM-supported ideation sessions, and researcher publication histories) and discuss our findings, as well as strengths, limitations, and potential future applications of our approach.",
      "authors": [
        "Smith, Amy",
        "Anderson, Barrett R.",
        "Otto, Jasmine Tan",
        "Karth, Isaac",
        "Sun, Yuqian",
        "Chung, John Joon Young",
        "Roemmele, Melissa",
        "Kreminski, Max"
      ],
      "last_revised_date": "2025/06/19",
      "links": {
        "HTML (experimental)": "https://arxiv.org/html/2502.04599v2",
        "Other Formats": "https://arxiv.org/format/2502.04599",
        "TeX Source": "https://arxiv.org/src/2502.04599",
        "View PDF": "https://arxiv.org/pdf/2502.04599"
      },
      "relevance": {
        "reason": "The paper explicitly focuses on creativity by analyzing 'creative activity traces' through the method of linkography, which is tied to understanding creative ideation and design processes.",
        "keyword": "creativity",
        "level": "strong"
      },
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "details": "Fri, 7 Feb 2025 01:16:59 UTC (5,481 KB)",
          "link": "/",
          "version": "[v1]"
        },
        {
          "details": "Thu, 19 Jun 2025 04:41:19 UTC (5,477 KB)",
          "version": "[v2]"
        }
      ],
      "submitted_date": "2025/02/07",
      "title": "Fuzzy Linkography: Automatic Graphical Summarization of Creative Activity Traces",
      "repo_urls": [
        "https://github.com/mkremins/fuzzy-linkography"
      ],
      "type": "paper",
      "source": "arxiv"
    },
    {
      "id": "2506.15873",
      "abstract": "Generative AI promises to allow people to create high-quality personalized media. Although powerful, we identify three fundamental design problems with existing tooling through a literature review. We introduce a multimodal generative AI tool, DeckFlow, to address these problems. First, DeckFlow supports task decomposition by allowing users to maintain multiple interconnected subtasks on an infinite canvas populated by cards connected through visual dataflow affordances. Second, DeckFlow supports a specification decomposition workflow where an initial goal is iteratively decomposed into smaller parts and combined using feature labels and clusters. Finally, DeckFlow supports generative space exploration by generating multiple prompt and output variations, presented in a grid, that can feed back recursively into the next design iteration. We evaluate DeckFlow for text-to-image generation against a state-of-practice conversational AI baseline for image generation tasks. We then add audio generation and investigate user behaviors in a more open-ended creative setting with text, image, and audio outputs.",
      "authors": [
        "Croisdale, Gregory",
        "Huang, Emily",
        "Chung, John Joon Young",
        "Guo, Anhong",
        "Wang, Xu",
        "Henley, Austin Z.",
        "Omar, Cyrus"
      ],
      "last_revised_date": "2025/06/18",
      "links": {
        "HTML (experimental)": "https://arxiv.org/html/2506.15873v1",
        "Other Formats": "https://arxiv.org/format/2506.15873",
        "TeX Source": "https://arxiv.org/src/2506.15873",
        "View PDF": "https://arxiv.org/pdf/2506.15873"
      },
      "relevance": {
        "reason": "The paper focuses on a multimodal generative AI tool, DeckFlow, and explores generative space exploration in a creative setting. It addresses issues related to creating personalized media and supports open-ended creative processes, indicating a strong relevance to the topic of creativity.",
        "keyword": "creativity",
        "level": "strong"
      },
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "details": "Wed, 18 Jun 2025 20:40:31 UTC (6,058 KB)",
          "version": "[v1]"
        }
      ],
      "submitted_date": "2025/06/18",
      "title": "DeckFlow: Iterative Specification on a Multimodal Generative Canvas",
      "type": "paper",
      "source": "arxiv"
    },
    {
      "id": "2411.02263",
      "abstract": "Let's transform our robot secretaries into Socratic gadflies.",
      "authors": [
        "Sarkar, Advait"
      ],
      "last_revised_date": "2025/06/20",
      "links": {
        "HTML (experimental)": "https://arxiv.org/html/2411.02263v2",
        "Other Formats": "https://arxiv.org/format/2411.02263",
        "TeX Source": "https://arxiv.org/src/2411.02263",
        "View PDF": "https://arxiv.org/pdf/2411.02263"
      },
      "relevance": {
        "reason": "The paper abstract suggests a focus on transforming AI to challenge rather than just follow orders, which could imply fostering creative thinking in human-AI interaction. However, creativity is not the central theme of the abstract.",
        "keyword": "creativity",
        "level": "weak"
      },
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "details": "Mon, 4 Nov 2024 16:54:48 UTC (33 KB)",
          "link": "/",
          "version": "[v1]"
        },
        {
          "details": "Fri, 20 Jun 2025 15:30:47 UTC (22 KB)",
          "version": "[v2]"
        }
      ],
      "submitted_date": "2024/11/04",
      "title": "AI Should Challenge, Not Obey",
      "type": "paper",
      "source": "arxiv"
    },
    {
      "id": "2506.17011",
      "abstract": "This study compares the impact of \"juiciness\" on user engagement and short-term information retention in interactive infographics. Juicy designs generally showed a slight advantage in overall user engagement scores compared to dry designs. Specifically, the juicy version of the Burcalories infographic had the highest engagement score. However, the differences in engagement were often small. Regarding information retention, the results were mixed. The juicy versions of The Daily Routines of Famous Creative People and The Main Chakras infographics showed marginally better average recall and more participants with higher recall. Conversely, the dry version of Burcalories led to more correct answers in multiple-choice questions. The study suggests that while juicy design elements can enhance user engagement and, in some cases, short-term information retention, their effectiveness depends on careful implementation. Excessive juiciness could be overwhelming or distracting, while well-implemented juicy elements contributed to a more entertaining experience. The findings emphasize the importance of balancing engaging feedback with clarity and usability.",
      "authors": [
        "Campos, Bruno"
      ],
      "last_revised_date": "2025/06/20",
      "links": {
        "Other Formats": "https://arxiv.org/format/2506.17011",
        "View PDF": "https://arxiv.org/pdf/2506.17011"
      },
      "relevance": {
        "reason": "The paper mentions 'The Daily Routines of Famous Creative People,' which implies a focus on creative individuals, and it examines information retention linked to designs that could influence creative thinking. However, the main focus is on user engagement and information retention in interactive infographics, not on creativity itself.",
        "keyword": "creativity",
        "level": "weak"
      },
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "details": "Fri, 20 Jun 2025 14:10:11 UTC (1,150 KB)",
          "version": "[v1]"
        }
      ],
      "submitted_date": "2025/06/20",
      "title": "Juicy or Dry? A Comparative Study of User Engagement and Information Retention in Interactive Infographics",
      "type": "paper",
      "source": "arxiv"
    },
    {
      "id": "2506.16702",
      "abstract": "Large language models (LLMs) offer emerging opportunities for psychological and behavioral research, but methodological guidance is lacking. This article provides a framework for using LLMs as psychological simulators across two primary applications: simulating roles and personas to explore diverse contexts, and serving as computational models to investigate cognitive processes. For simulation, we present methods for developing psychologically grounded personas that move beyond demographic categories, with strategies for validation against human data and use cases ranging from studying inaccessible populations to prototyping research instruments. For cognitive modeling, we synthesize emerging approaches for probing internal representations, methodological advances in causal interventions, and strategies for relating model behavior to human cognition. We address overarching challenges including prompt sensitivity, temporal limitations from training data cutoffs, and ethical considerations that extend beyond traditional human subjects review. Throughout, we emphasize the need for transparency about model capabilities and constraints. Together, this framework integrates emerging empirical evidence about LLM performance--including systematic biases, cultural limitations, and prompt brittleness--to help researchers wrangle these challenges and leverage the unique capabilities of LLMs in psychological research.",
      "authors": [
        "Lin, Zhicheng"
      ],
      "last_revised_date": "2025/06/20",
      "links": {
        "Other Formats": "https://arxiv.org/format/2506.16702",
        "View PDF": "https://arxiv.org/pdf/2506.16702"
      },
      "relevance": {
        "reason": "While the paper primarily focuses on using large language models for psychological simulations, it touches upon diverse contexts and personas that could implicitly relate to creativity in exploring human cognition and behavior. However, creativity is not the main focus.",
        "keyword": "creativity",
        "level": "weak"
      },
      "subjects": [
        "Computers and Society (cs.CY)",
        "Artificial Intelligence (cs.AI)",
        "Computation and Language (cs.CL)",
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "details": "Fri, 20 Jun 2025 02:45:23 UTC (410 KB)",
          "version": "[v1]"
        }
      ],
      "submitted_date": "2025/06/20",
      "title": "Large Language Models as Psychological Simulators: A Methodological Guide",
      "type": "paper",
      "source": "arxiv"
    },
    {
      "id": "2506.16851",
      "abstract": "Recent studies show that users often interpret social media algorithms as mystical or spiritual because of their unpredictability. This invites new questions about how such perceptions affect the content that creators create and the communities they form online. In this study, 14 creators of algorithmic conspirituality content on TikTok were interviewed to explore their interpretations and creation processes influenced by the platform's For You Page algorithm. We illustrate how creators' beliefs interact with TikTok's algorithmic mediation to reinforce and shape their spiritual or relational themes. Furthermore, we show how algorithmic conspirituality content impacts viewers, highlighting its role in generating significant emotional and affective labor for creators, stemming from complex relational dynamics inherent in this content creation. We discuss implications for design to support creators aimed at recognizing the unexpected spiritual and religious experiences algorithms prompt, as well as supporting creators in effectively managing these challenges.",
      "authors": [
        "De, Ankolika",
        "Cotter, Kelley",
        "Kanthawala, Shaheen",
        "McAtee, Haley",
        "Ritchart, Amy",
        "Kadur, Gahana"
      ],
      "last_revised_date": "2025/06/20",
      "links": {
        "HTML (experimental)": "https://arxiv.org/html/2506.16851v1",
        "Other Formats": "https://arxiv.org/format/2506.16851",
        "TeX Source": "https://arxiv.org/src/2506.16851",
        "View PDF": "https://arxiv.org/pdf/2506.16851"
      },
      "relevance": {
        "reason": "The paper touches on creativity in terms of content creation influenced by social media algorithms but does not focus explicitly on creativity. It explores motivations and processes behind creating algorithmic content, which indirectly involves creative aspects, but the primary focus is on perceptions of algorithms and emotional labor.",
        "keyword": "creativity",
        "level": "weak"
      },
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "details": "Fri, 20 Jun 2025 08:58:56 UTC (108 KB)",
          "version": "[v1]"
        }
      ],
      "submitted_date": "2025/06/20",
      "title": "\"Whoever needs to see it, will see it\": Motivations and Labor of Creating Algorithmic Conspirituality Content on TikTok",
      "type": "paper",
      "source": "arxiv"
    },
    {
      "id": "2506.16312",
      "abstract": "This study investigated the impact of a theory-driven, explainable Learning Analytics Dashboard (LAD) on university students' human-AI collaborative academic abstract writing task. Grounded in Self-Regulated Learning (SRL) theory and incorporating Explainable AI (XAI) principles, our LAD featured a three-layered design (Visual, Explainable, Interactive). In an experimental study, participants were randomly assigned to either an experimental group (using the full explainable LAD) or a control group (using a visual-only LAD) to collaboratively write an academic abstract with a Generative AI. While quantitative analysis revealed no significant difference in the quality of co-authored abstracts between the two groups, a significant and noteworthy difference emerged in conceptual understanding: students in the explainable LAD group demonstrated a superior grasp of abstract writing principles, as evidenced by their higher scores on a knowledge test (p= .026). These findings highlight that while basic AI-generated feedback may suffice for immediate task completion, the provision of explainable feedback is crucial for fostering deeper learning, enhancing conceptual understanding, and developing transferable skills fundamental to self-regulated learning in academic writing contexts.",
      "authors": [
        "Chen, Angxuan"
      ],
      "last_revised_date": "2025/06/19",
      "links": {
        "Other Formats": "https://arxiv.org/format/2506.16312",
        "View PDF": "https://arxiv.org/pdf/2506.16312"
      },
      "relevance": {
        "reason": "The study involves human-AI collaboration in academic writing, which can be linked to creativity in terms of producing creative written content. However, the main focus is on learning analytics and explainable AI rather than creativity itself.",
        "keyword": "creativity",
        "level": "weak"
      },
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "details": "Thu, 19 Jun 2025 13:38:17 UTC (533 KB)",
          "version": "[v1]"
        }
      ],
      "submitted_date": "2025/06/19",
      "title": "When learning analytics dashboard is explainable: An exploratory study on the effect of GenAI-supported learning analytics dashboard",
      "type": "paper",
      "source": "arxiv"
    },
    {
      "id": "2502.15242",
      "abstract": "Current image generation paradigms prioritize actualizing user intention - \"see what you intend\" - but often neglect the sociopolitical dimensions of this process. However, it is increasingly evident that image generation is political, contributing to broader social struggles over visual meaning. This sociopolitical aspect was highlighted by the March 2024 Gemini controversy, where Gemini faced criticism for inappropriately injecting demographic diversity into user prompts. Although the developers sought to redress image generation's sociopolitical dimension by introducing diversity \"corrections,\" their opaque imposition of a standard for \"diversity\" ultimately proved counterproductive. In this paper, we present an alternative approach: an image generation interface designed to embrace open negotiation along the sociopolitical dimensions of image creation. Grounded in the principles of agonistic pluralism (from the Greek agon, meaning struggle), our interface actively engages users with competing visual interpretations of their prompts. Through a lab study with 29 participants, we evaluate our agonistic interface on its ability to facilitate reflection - engagement with other perspectives and challenging dominant assumptions - a core principle that underpins agonistic contestation. We compare it to three existing paradigms: a standard interface, a Gemini-style interface that produces \"diverse\" images, and an intention-centric interface suggesting prompt refinements. Our findings demonstrate that the agonistic interface enhances reflection across multiple measures, but also that reflection depends on users perceiving the interface as both appropriate and empowering; introducing diversity without grounding it in relevant political contexts was perceived as inauthentic. Our results suggest that diversity and user intention should not be treated as opposing values to be balanced.",
      "authors": [
        "Shaw, Andrew",
        "Ye, Andre",
        "Krishna, Ranjay",
        "Zhang, Amy X."
      ],
      "last_revised_date": "2025/06/19",
      "links": {
        "HTML (experimental)": "https://arxiv.org/html/2502.15242v3",
        "Other Formats": "https://arxiv.org/format/2502.15242",
        "TeX Source": "https://arxiv.org/src/2502.15242",
        "View PDF": "https://arxiv.org/pdf/2502.15242"
      },
      "relevance": {
        "reason": "The paper focuses on agonistic image generation and the sociopolitical dimensions of image creation rather than creativity itself. Creativity is not the main focus, but the concept of 'open negotiation' and engagement with different perspectives could indirectly relate to creative processes.",
        "keyword": "creativity",
        "level": "weak"
      },
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "details": "Fri, 21 Feb 2025 06:30:42 UTC (27,634 KB)",
          "link": "/",
          "version": "[v1]"
        },
        {
          "details": "Sat, 1 Mar 2025 22:19:48 UTC (27,634 KB)",
          "link": "/",
          "version": "[v2]"
        },
        {
          "details": "Thu, 19 Jun 2025 00:02:22 UTC (10,035 KB)",
          "version": "[v3]"
        }
      ],
      "submitted_date": "2025/02/21",
      "title": "Agonistic Image Generation: Unsettling the Hegemony of Intention",
      "type": "paper",
      "source": "arxiv"
    },
    {
      "id": "2506.16168",
      "abstract": "Imagine unlocking the power of the mind to communicate, create, and even interact with the world around us. Recent breakthroughs in Artificial Intelligence (AI), especially in how machines \"see\" and \"understand\" language, are now fueling exciting progress in decoding brain signals from scalp electroencephalography (EEG). Prima facie, this opens the door to revolutionary brain-computer interfaces (BCIs) designed for real life, moving beyond traditional uses to envision Brain-to-Speech, Brain-to-Image, and even a Brain-to-Internet of Things (BCIoT). However, the journey is not as straightforward as it was for Computer Vision (CV) and Natural Language Processing (NLP). Applying AI to real-world EEG-based BCIs, particularly in building powerful foundational models, presents unique and intricate hurdles that could affect their reliability. Here, we unfold a guided exploration of this dynamic and rapidly evolving research area. Rather than barely outlining a map of current endeavors and results, the goal is to provide a principled navigation of this hot and cutting-edge research landscape. We consider the basic paradigms that emerge from a causal perspective and the attendant challenges presented to AI-based models. Looking ahead, we then discuss promising research avenues that could overcome today's technological, methodological, and ethical limitations. Our aim is to lay out a clear roadmap for creating truly practical and effective EEG-based BCI solutions that can thrive in everyday environments.",
      "authors": [
        "Barbera, Thomas",
        "Burger, Jacopo",
        "D'Amelio, Alessandro",
        "Zini, Simone",
        "Bianco, Simone",
        "Lanzarotti, Raffaella",
        "Napoletano, Paolo",
        "Boccignone, Giuseppe",
        "Contreras-Vidal, Jose Luis"
      ],
      "last_revised_date": "2025/06/19",
      "links": {
        "HTML (experimental)": "https://arxiv.org/html/2506.16168v1",
        "Other Formats": "https://arxiv.org/format/2506.16168",
        "TeX Source": "https://arxiv.org/src/2506.16168",
        "View PDF": "https://arxiv.org/pdf/2506.16168"
      },
      "relevance": {
        "reason": "The paper discusses brain-computer interfaces which can be used for creative activities like Brain-to-Image, but creativity is not the central focus of the paper.",
        "keyword": "creativity",
        "level": "weak"
      },
      "subjects": [
        "Human-Computer Interaction (cs.HC)",
        "Artificial Intelligence (cs.AI)"
      ],
      "submission_historys": [
        {
          "details": "Thu, 19 Jun 2025 09:43:17 UTC (442 KB)",
          "version": "[v1]"
        }
      ],
      "submitted_date": "2025/06/19",
      "title": "On using AI for EEG-based BCI applications: problems, current challenges and future trends",
      "type": "paper",
      "source": "arxiv"
    },
    {
      "id": "2412.00630",
      "abstract": "Cosplay commission (cos-commission) is a new form of commodified romantic companionship within the Otome game community in China. To explore the motivations, practices, experiences, and challenges, we conducted semi-structured interviews with 15 participants in different roles. Our findings reveal that cos-commission, as a hybrid activity, provides participants with a chance to collaboratively build meaningful connections. It also offers a pathway for personal exploration and emotional recovery. However, the vague boundary between performative roles and intimate interactions can give rise to unexpected negative outcomes, such as attachment-driven entanglements and post-commission \"withdrawal symptoms.\" While digital platforms facilitate communication in cos-commissions, they often lack sufficient safeguards. This preliminary work provides insights into the formation process of hybrid intimate relationship and its potential to foster personalized, long-term support for mental well-being, and reveals potential privacy and security challenges.",
      "authors": [
        "Zhou, Yihao",
        "Xu, Haowei",
        "Zhang, Lili",
        "Zhao, Shengdong"
      ],
      "last_revised_date": "2025/06/18",
      "links": {
        "HTML (experimental)": "https://arxiv.org/html/2412.00630v2",
        "Other Formats": "https://arxiv.org/format/2412.00630",
        "TeX Source": "https://arxiv.org/src/2412.00630",
        "View PDF": "https://arxiv.org/pdf/2412.00630"
      },
      "relevance": {
        "reason": "The paper primarily focuses on the intimacy and personal relationships within the cosplay commission practice in the Otome game community, which may involve aspects of personal exploration that can be related to creativity. However, creativity is not the explicit focus of the study.",
        "keyword": "creativity",
        "level": "weak"
      },
      "subjects": [
        "Human-Computer Interaction (cs.HC)"
      ],
      "submission_historys": [
        {
          "details": "Sun, 1 Dec 2024 01:00:57 UTC (1,201 KB)",
          "link": "/",
          "version": "[v1]"
        },
        {
          "details": "Wed, 18 Jun 2025 18:44:44 UTC (993 KB)",
          "version": "[v2]"
        }
      ],
      "submitted_date": "2024/12/01",
      "title": "Collective Creation of Intimacy: Exploring the Cosplay Commission Practice within the Otome Game Community in China",
      "type": "paper",
      "source": "arxiv"
    }
  ],
  "subjects": [
    "Computation and Language (cs.CL)",
    "Artificial Intelligence (cs.AI)",
    "Computers and Society (cs.CY)",
    "Human-Computer Interaction (cs.HC)"
  ]
}